wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
/*!
    \file    gd32h77x_nvmc.c
    \brief   NVMC driver

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_nvmc.h"

#if (defined(GD32H77EXW) || (GD32H77DXW) || (GD32H779XW))
#define NVM_VER_CASE1
#elif (defined(GD32H77EXP) || (GD32H77DXP) || (GD32H779XP))
#define NVM_VER_CASE2
#elif (defined(GD32H77EXN) || (GD32H77DXN) || (GD32H779XN))
#define NVM_VER_CASE3
#elif (defined(GD32H77EXI) || (GD32H77DXI) || (GD32H779XI))
#define NVM_VER_CASE4
#endif

/* NVMC register bit offset */
#define BTADDR_BOOT_ADDR0_OFFSET                    ((uint32_t)0x00000000U)       /*!< bit offset of BOOT_ADDR0 in NVMC_BTADDR_EFT/NVMC_BTADDR_MDF */
#define BTADDR_BOOT_ADDR1_OFFSET                    ((uint32_t)0x00000010U)       /*!< bit offset of BOOT_ADDR1 in NVMC_BTADDR_EFT/NVMC_BTADDR_MDF */
#define SCRADDR_SCR_AREA_START_OFFSET               ((uint32_t)0x00000000U)       /*!< bit offset of SCR_AREA_START in NVMC_SCRADDR_EFT/NVMC_SCRADDR_MDF */
#define SCRADDR_SCR_AREA_END_OFFSET                 ((uint32_t)0x00000010U)       /*!< bit offset of SCR_AREA_END in NVMC_SCRADDR_EFT/NVMC_SCRADDR_MDF */
#define DCRPADDR_DCRP_AREA_START_OFFSET             ((uint32_t)0x00000000U)       /*!< bit offset of DCRP_AREA_START in NVMC_DCRPADDR_EFT/NVMC_DCRPADDR_MDF */
#define DCRPADDR_DCRP_AREA_END_OFFSET               ((uint32_t)0x00000010U)       /*!< bit offset of DCRP_AREA_END in NVMC_DCRPADDR_EFT/NVMC_DCRPADDR_MDF */
#define OBSTAT0_SPC_OFFSET                          ((uint32_t)0x00000008U)       /*!< bit offset of SPC in NVMC_OBSTAT0_EFT/NVMC_OBSTAT0_MDF */
#define OBSTAT1_DATA_OFFSET                         ((uint32_t)0x00000010U)       /*!< bit offset of DATA in NVMC_OBSTAT1_EFT/NVMC_OBSTAT1_MDF */
#define OBREPSTADDR_STARTADDR_OFFSET                ((uint32_t)0x00000005U)       /*!< bit offset of STARTADDR in NVMC_OBREPSTADDR_EFT_STARTADDR/NVMC_OBREPSTADDR_MDF_STARTADDR */
#define OBREPSTADDR_ENDADDR_OFFSET                  ((uint32_t)0x00000005U)       /*!< bit offset of ENDADDR in NVMC_OBREPSTADDR_EFT_STARTADDR/NVMC_OBREPSTADDR_MDF_STARTADDR */
#define OBBBADDRX_OBBBADDRVLD_OFFSET                ((uint32_t)0x00000000U)       /*!< bit offset of OBBBADDRVLD in NVMC_OBBBADDRX_EFT/NVMC_OBBBADDRX_MDF */
#define OBBBADDRX_OBBBADDR_OFFSET                   ((uint32_t)0x00000005U)       /*!< bit offset of OBBBADDR in NVMC_OBBBADDRX_EFT/NVMC_OBBBADDRX_MDF */
#define OBREPCTL_COPYSZ_OFFSET                      ((uint32_t)0x0000001AU)       /*!< bit offset of COPYSZ in NVMC_OBREPCTL_EFT/NVMC_OBREPCTL_MDF */
#define OBREPCTL_ERR1CNTTH_OFFSET                   ((uint32_t)0x00000010U)       /*!< bit offset of ERR1CNTTH in NVMC_OBREPCTL_EFT/NVMC_OBREPCTL_MDF */
#define OBREPCTL_ERR2CNTTH_OFFSET                   ((uint32_t)0x00000015U)       /*!< bit offset of ERR2CNTTH in NVMC_OBREPCTL_EFT/NVMC_OBREPCTL_MDF */
#define OBREPCTL_SYNSZ_OFFSET                       ((uint32_t)0x00000008U)       /*!< bit offset of SYNSZ in NVMC_OBREPCTL_EFT/NVMC_OBREPCTL_MDF */

#define ROBBADDRX_ROBBADDRSTAT_OFFSET               ((uint32_t)0x00000000U)       /*!< bit offset of ROBBADDRSTAT in NVMC_ENVM_ROBBADDRX */
#define ROBBADDRX_ROBBADDR_OFFSET                   ((uint32_t)0x00000005U)       /*!< bit offset of ROBBADDR in NVMC_ENVM_ROBBADDRX */
#define AUTOERR1ADDRX_AUTOERR1ADDRSTAT_OFFSET       ((uint32_t)0x00000000U)       /*!< bit offset of AUTOERR1ADDRSTAT in NVMC_ENVM_AUTOERR1ADDRX */
#define AUTOERR1ADDRX_AUTOERR1ADDR_OFFSET           ((uint32_t)0x00000005U)       /*!< bit offset of AUTOERR1ADDR in NVMC_ENVM_AUTOERR1ADDRX */
#define AUTOERR2ADDRX_AUTOERR2ADDRSTAT_OFFSET       ((uint32_t)0x00000000U)       /*!< bit offset of AUTOERR2ADDRSTAT in NVMC_ENVM_AUTOERR2ADDRX */
#define AUTOERR2ADDRX_AUTOERR2ADDR_OFFSET           ((uint32_t)0x00000005U)       /*!< bit offset of AUTOERR2ADDR in NVMC_ENVM_AUTOERR2ADDRX */
#define UNREPECCADDRX_ERRADDRSTAT_OFFSET            ((uint32_t)0x00000000U)       /*!< bit offset of ERRADDRSTAT in NVMC_ENVM_UNREPECCADDRX */
#define UNREPECCADDRX_ERRADDR_OFFSET                ((uint32_t)0x00000005U)       /*!< bit offset of ERRADDR in NVMC_ENVM_UNREPECCADDRX */

#define ENVM_REPCS_ERR2CNT_OFFSET                   ((uint32_t)0x0000001BU)       /*!< bit offset of ERR2CNT in NVMC_ENVM_REPCS */
#define ENVM_REPCS_ERR1CNT_OFFSET                   ((uint32_t)0x00000016U)       /*!< bit offset of ERR1CNT in NVMC_ENVM_REPCS */
#define ENVM_REPCS_ROBBCNT_OFFSET                   ((uint32_t)0x00000010U)       /*!< bit offset of ROBBCNT in NVMC_ENVM_REPCS */
#define ENVM_REPCS_REPERRSTAT_OFFSET                ((uint32_t)0x00000008U)       /*!< bit offset of REPERRSTAT in NVMC_ENVM_REPCS */

