wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
#define WP1_FLASH_OFFSET                            ((uint32_t)0x00000020U)       /*!< bit offset of WP1_FLASH in OB_FL_WP_ALL */

/* option byte factory value */
#define OB_OBSTAT0_FACTORY_VALUE                    ((uint32_t)0x5FC6AAD0U)       /*!< the factory value of option byte in NVMC_OBSTAT0_EFT/NVMC_OBSTAT0_MDF */
#define OB_OBSTAT1_FACTORY_VALUE                    ((uint32_t)0xFFFF0000U)       /*!< the factory value of option byte in NVMC_OBSTAT1_EFT/NVMC_OBSTAT1_MDF */
#define OB_BTADDR_FACTORY_VALUE                     ((uint32_t)0x1FEF0800U)       /*!< the factory value of option byte in NVMC_BTADDR_EFT/NVMC_BTADDR_MDF */
#define OB_DCRPADDR_FACTORY_VALUE                   ((uint32_t)0x000001FFU)       /*!< the factory value of option byte in NVMC_DCRPADDR_EFT/NVMC_DCRPADDR_MDF */
#define OB_SCRADDR_FACTORY_VALUE                    ((uint32_t)0x000001FFU)       /*!< the factory value of option byte in NVMC_SCRADDR_EFT/NVMC_SCRADDR_MDF */
#define OB_WP_ENVM_FACTORY_VALUE                    ((uint32_t)0x0000FFFFU)       /*!< the factory value of option byte in NVMC_WP_ENVM_EFT/NVMC_WP_ENVM_MDF */
#define OB_WP0_FLASH_FACTORY_VALUE                  ((uint32_t)0xFFFFFFFFU)       /*!< the factory value of option byte in NVMC_WP0_FLASH_EFT/NVMC_WP0_FLASH_MDF */
#define OB_WP1_FLASH_FACTORY_VALUE                  ((uint32_t)0x0FFFFFFFU)       /*!< the factory value of option byte in NVMC_WP1_FLASH_EFT/NVMC_WP1_FLASH_MDF */
#define OB_OBREPCTL_FACTORY_VALUE                   ((uint32_t)0xFE10DF00U)       /*!< the factory value of option byte in NVMC_OBREPCTL_EFT/NVMC_OBREPCTL_MDF */
#define OB_OBREPSTADDR_FACTORY_VALUE                ((uint32_t)0x08000000U)       /*!< the factory value of option byte in NVMC_OBREPSTADDR_EFT/NVMC_OBREPSTADDR_MDF */
#define OB_OBREPENDADDR_FACTORY_VALUE               ((uint32_t)0x08000000U)       /*!< the factory value of option byte in NVMC_OBREPENDADDR_EFT/NVMC_OBREPENDADDR_MDF */
#define OB_OBBBADDRX_FACTORY_VALUE                  ((uint32_t)0x08000000U)       /*!< the factory value of option byte in NVMC_OBBBADDRX_EFT/NVMC_OBBBADDRX_MDF */

/* NVMC parameter mask */
#define DCRP_EN_MASK                                ((uint32_t)0x0000E000U)        /*!< DCRP area enable bits mask */
#define DCRP_EREN_MASK                              ((uint32_t)0xE0000000U)        /*!< DCRP area erase enable bits mask */
#define SCR_EN_MASK                                 ((uint32_t)0x0000E000U)        /*!< SCR area enable bits mask */
#define SCR_EREN_MASK                               ((uint32_t)0xE0000000U)        /*!< SCR area erase enable bits mask */
#define LOW_32BITS_MASK                             ((uint32_t)0xFFFFFFFFU)        /*!< the 0-31 bits mask of a word */

#define NVMC_DCRPADDR_MDF_DCRP_EREN_29_31 (NVMC_DCRPADDR_MDF_FLB1_DCRP_EREN | NVMC_DCRPADDR_MDF_FLB0_DCRP_EREN | NVMC_DCRPADDR_MDF_ENVM_DCRP_EREN)
#define NVMC_SCRADDR_MDF_SCR_EREN_29_31 (NVMC_SCRADDR_MDF_FLB1_SCR_EREN | NVMC_SCRADDR_MDF_FLB0_SCR_EREN | NVMC_SCRADDR_MDF_ENVM_SCR_EREN)

/* get ENVM state */
static envm_state_enum nvmc_envm_state_get(void);
/* check ENVM ready or not */
static envm_state_enum nvmc_envm_ready_wait(uint32_t timeout);
/* get ENVM crc state */
static envm_state_enum nvmc_envm_crc_state_get(void);
/* check ENVM crc ready or not */
static envm_state_enum nvmc_envm_crc_ready_wait(uint32_t timeout);
/* get ENVM repair state */
static envm_state_enum nvmc_envm_repair_state_get(void);
/* check ENVM repair ready or not */
static envm_state_enum nvmc_envm_repair_ready_wait(uint32_t timeout);
/* get flash state */
static flash_state_enum nvmc_flash_state_get(void);
/* check flash ready or not */
static flash_state_enum nvmc_flash_ready_wait(uint32_t timeout);
/* get OTP state */
static otp_state_enum nvmc_otp_state_get(void);
/* check OTP ready or not */
static otp_state_enum nvmc_otp_ready_wait(uint32_t timeout);
/* get option byte state */
static nvmc_ob_state_enum nvmc_ob_state_get(void);
/* check option byte ready or not */
static nvmc_ob_state_enum nvmc_ob_ready_wait(uint32_t timeout);

/*!
    \brief      unlock register NVMC_ENVM_CTL (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_envm_unlock(void)
{
    if((RESET != (NVMC_ENVM_CTL & NVMC_ENVM_CTL_LK))) {
        /* write the ENVM key */
        NVMC_ENVM_KEY = UNLOCK_KEY0;
        NVMC_ENVM_KEY = UNLOCK_KEY1;
    }
}

/*!
    \brief      lock register NVMC_ENVM_CTL (API_ID(0x0002U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_envm_lock(void)
{
    /* set the LK bit*/
    NVMC_ENVM_CTL |= NVMC_ENVM_CTL_LK;
}

/*!
    \brief      set the ENVM wait state counter value (API_ID(0x0003U))
    \param[in]  wscnt: wait state counter value
                only one parameter can be selected which is shown as below:
      \arg        PERFCTL_WSCNT_1: 1 wait state added
      \arg        PERFCTL_WSCNT_2: 2 wait state added
      \arg        PERFCTL_WSCNT_3: 3 wait state added
      \arg        PERFCTL_WSCNT_4: 4 wait state added
      \arg        PERFCTL_WSCNT_5: 5 wait state added
      \arg        PERFCTL_WSCNT_6: 6 wait state added
      \arg        PERFCTL_WSCNT_7: 7 wait state added
      \arg        PERFCTL_WSCNT_8: 8 wait state added
      \arg        PERFCTL_WSCNT_9: 9 wait state added
      \arg        PERFCTL_WSCNT_10: 10 wait state added
      \arg        PERFCTL_WSCNT_11: 11 wait state added
      \arg        PERFCTL_WSCNT_12: 12 wait state added
      \arg        PERFCTL_WSCNT_13: 13 wait state added
      \arg        PERFCTL_WSCNT_14: 14 wait state added
      \arg        PERFCTL_WSCNT_15: 15 wait state added
    \param[out] none
    \retval     none
*/
void nvmc_envm_wscnt_set(uint8_t wscnt)
{
    uint32_t reg;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENVM_PERFCTL_WSCNT(wscnt)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg = NVMC_PERFCTL;
        /* set the wait state counter value */
        reg &= ~NVMC_PERFCTL_WSCNT;
        NVMC_PERFCTL = (reg | wscnt);
    }
}

/*!
    \brief      empty ENVM buffer(general buffer and CPU buffer) (API_ID(0x0004U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_envm_buf_empty(void)
{
    NVMC_PERFCTL |= NVMC_PERFCTL_EMPTY_ENVM_BUF;
}

/*!
    \brief      configure flash buffer (API_ID(0x0005U))
    \param[in]  buf_configure: flash buffer prefetch control
                only one parameter can be selected which is shown as below:
      \arg        FLASH_NO_PREFETCH: flash no prefetch
      \arg        FLASH_PREFETCH_1_LINE: flash prefetch 1 line
      \arg        FLASH_PREFETCH_3_LINE: flash prefetch 3 line
    \param[out] none
    \retval     none
*/
void nvmc_flash_buffer_configure(uint32_t buf_configure)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_FLASH_PREFETCH(buf_configure)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else
#endif
    {
        NVMC_PERFCTL &= ~NVMC_PERFCTL_FLASH_BUF_PFETCH;
        NVMC_PERFCTL |= buf_configure;
    }
}

/*!
    \brief      configure ENVM general buffer size (API_ID(0x0006U))
    \param[in]  size: general buffer size
                only one parameter can be selected which is shown as below:
      \arg        ENVM_GP_BUF_SIZE1: ENVM general buffer size is 1x32 bytes
      \arg        ENVM_GP_BUF_SIZE2: ENVM general buffer size is 2x32 bytes
      \arg        ENVM_GP_BUF_SIZE4: ENVM general buffer size is 4x32 bytes
      \arg        ENVM_GP_BUF_SIZE8: ENVM general buffer size is 8x32 bytes
    \param[out] none
    \retval     none
*/
void nvmc_envm_gp_buffer_configure(uint32_t size)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENVM_GP_BUF_SIZE(size)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    } else
#endif
    {
        NVMC_PERFCTL &= ~NVMC_PERFCTL_ENVM_GP_BUFSZ;
        NVMC_PERFCTL |= size;
    }
}

/*!
    \brief      configure ENVM CPU buffer size (API_ID(0x0007U))
    \param[in]  size: CPU buffer size
                only one parameter can be selected which is shown as below:
      \arg        ENVM_CPU_BUF_SIZE1: ENVM CPU buffer size is 1x32 bytes
      \arg        ENVM_CPU_BUF_SIZE2: ENVM CPU buffer size is 2x32 bytes
      \arg        ENVM_CPU_BUF_SIZE4: ENVM CPU buffer size is 4x32 bytes
      \arg        ENVM_CPU_BUF_SIZE8: ENVM CPU buffer size is 8x32 bytes
    \param[out] none
    \retval     none
*/
void nvmc_envm_cpu_buffer_configure(uint32_t size)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENVM_CPU_BUF_SIZE(size)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else
#endif
    {
        NVMC_PERFCTL &= ~NVMC_PERFCTL_ENVM_CPU_BUFSZ;
        NVMC_PERFCTL |= size;
    }
}

/*!
    \brief      program 32 bytes at the corresponding address (API_ID(0x0008U))
    \param[in]  address: address to program, the address is in the range of ENVM block
    \param[in]  data: 32 bytes to program
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus nvmc_envm_32bytes_program(uint32_t address, uint64_t data[])
{
    uint32_t index;
    ErrStatus status;
    envm_state_enum envm_state = ENVM_READY;
    flash_state_enum flash_state = FLASH_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENVM_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0008U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(data)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0008U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* wait for ENVM ready */
        envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);

