wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
        uint32_t sync_area_size = nvmc_ob_sync_area_size_get();
        if((nvmc_ob_sync_mode_get() == SET) && ((address - ENVM_BASE_ADDRESS) < sync_area_size)) {
            /* wait for flash ready */
            flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);

            if((ENVM_READY == envm_state) && (FLASH_READY == flash_state)) {
                /* set the PG bit to start program */
                NVMC_ENVM_CTL |= NVMC_ENVM_CTL_PG;

                __ISB();
                __DSB();

                for(index = 0U; index < 4U; index++) {
                    REG64(address) = data[index];
                    __DSB();
                    address += 8U;
                }

                __ISB();
                __DSB();

                /* wait for the ENVM ready */
                envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);
                /* wait for the flash ready */
                flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);
                /* reset the PG bit */
                NVMC_ENVM_CTL &= ~NVMC_ENVM_CTL_PG;

                if((FLASH_READY == flash_state) && (ENVM_READY == envm_state)) {
                    status = SUCCESS;
                } else {
                    status = ERROR;
                }
            } else {
                status = ERROR;
            }
        } else {
            if(ENVM_READY == envm_state) {
                /* set the PG bit to start program */
                NVMC_ENVM_CTL |= NVMC_ENVM_CTL_PG;

                __ISB();
                __DSB();

                for(index = 0U; index < 4U; index++) {
                    REG64(address) = data[index];
                    __DSB();
                    address += 8U;
                }

                __ISB();
                __DSB();

                /* wait for the ENVM ready */
                envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);
                /* reset the PG bit */
                NVMC_ENVM_CTL &= ~NVMC_ENVM_CTL_PG;

                if(ENVM_READY == envm_state) {
                    status = SUCCESS;
                } else {
                    status = ERROR;
                }
            } else {
                status = ERROR;
            }
        }
    }
    return status;
}

/*!
    \brief      erase sector of ENVM (API_ID(0x0009U))
    \param[in]  address: sector address to erase
    \param[out] none
    \retval     state of ENVM
      \arg        ENVM_READY: ENVM operation has been completed
      \arg        ENVM_BUSY: ENVM operation is in progress
      \arg        ENVM_WPERR: ENVM erase/program protection error
      \arg        ENVM_PGSERR: ENVM program sequence error
      \arg        ENVM_RPERR: ENVM read protection error
      \arg        ENVM_RSERR: ENVM read secure error
      \arg        ENVM_TOERR: ENVM timeout error
*/
envm_state_enum nvmc_envm_sector_erase(uint32_t address)
{
    envm_state_enum envm_state = ENVM_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ENVM_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0009U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* wait for the ENVM ready */
        envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);

        if(ENVM_READY == envm_state) {
            NVMC_ENVM_CTL |= NVMC_ENVM_CTL_SER;
            /* write the sector address */
            NVMC_ENVM_ADDR = address;
            /* start sector erase */
            NVMC_ENVM_CTL |= NVMC_ENVM_CTL_START;
            /* wait for the ENVM ready */
            envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);
            /* reset the SER bit */
            NVMC_ENVM_CTL &= (~NVMC_ENVM_CTL_SER);
        }
    }
    /* return the ENVM state */
    return envm_state;
}

#ifndef NVM_VER_CASE4
/*!
    \brief      erase whole ENVM (API_ID(0x000AU))
    \param[in]  none
    \param[out] none
    \retval     state of ENVM
      \arg        ENVM_READY: ENVM operation has been completed
      \arg        ENVM_BUSY: ENVM operation is in progress
      \arg        ENVM_WPERR: ENVM erase/program protection error
      \arg        ENVM_PGSERR: ENVM program sequence error
      \arg        ENVM_RPERR: ENVM read protection error
      \arg        ENVM_RSERR: ENVM read secure error
      \arg        ENVM_TOERR: ENVM timeout error
*/
envm_state_enum nvmc_envm_mass_erase(void)
{
    envm_state_enum envm_state = ENVM_READY;

    /* wait for the ENVM ready */
    envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);

    if(ENVM_READY == envm_state) {
        /* enable mass erase operation */
        NVMC_ENVM_CTL |= NVMC_ENVM_CTL_MER;
        /* start whole ENVM */
        NVMC_ENVM_CTL |= NVMC_ENVM_CTL_START;
        /* wait for the ENVM ready */
        envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);
        /* reset the MER bit */
        NVMC_ENVM_CTL &= ~NVMC_ENVM_CTL_MER;
    }

    /* return the ENVM state */
    return envm_state;
}

/*!
    \brief      erase whole chip, including ENVM and flash (API_ID(0x000BU))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus nvmc_typical_chip_erase(void)
{
    ErrStatus status;
    envm_state_enum envm_state = ENVM_READY;
    flash_state_enum flash_state = FLASH_READY;

    /* wait for the ENVM ready */
    envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);

    /* wait for the ENVM ready */
    flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);

    if((ENVM_READY == envm_state) && (FLASH_READY == flash_state)) {
        /* enable chip erase operation */
        NVMC_ENVM_CTL |= NVMC_ENVM_CTL_CER;
        /* start whole chip erase */
        NVMC_ENVM_CTL |= NVMC_ENVM_CTL_START;
        /* wait for the ENVM ready */
        envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);
        flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);
        /* reset the CER bit */
        NVMC_ENVM_CTL &= ~NVMC_ENVM_CTL_CER;

        if((FLASH_READY == flash_state) && (ENVM_READY == envm_state)) {
            status = SUCCESS;
        } else {
            status = ERROR;
        }
    } else {
        status = ERROR;
    }

    /* return the NVMC state */
    return status;
}

/*!
    \brief      erase whole chip, including ENVM and flash, the secure area and dcrp area will also be erased (API_ID(0x000CU))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus nvmc_protection_removed_chip_erase(void)
{
    ErrStatus status;
    envm_state_enum envm_state = ENVM_READY;
    flash_state_enum flash_state = FLASH_READY;

    /* wait for the ENVM ready */
    envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);
    /* wait for the Flash ready */
    flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);

