wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
    if((ENVM_READY == envm_state) && (FLASH_READY == flash_state)) {
        NVMC_FLASH_CTL |= NVMC_FLASH_CTL_CHIP_REMOVE_EN;
        /* remove DCRP area */
        NVMC_DCRPADDR_MDF = NVMC_DCRPADDR_MDF_DCRP_EREN_29_31 | INVALID_DCRP_START_ADDR;
        /* remove secure-access area */
        NVMC_SCRADDR_MDF = NVMC_SCRADDR_MDF_SCR_EREN_29_31 | INVALID_SCR_START_ADDR;
        /* disable all sectors' erase/program protection */
        NVMC_WP_ENVM_MDF = OB_ENVM_WP_ALL;
        NVMC_WP0_FLASH_MDF = (uint32_t)(OB_FL_WP_ALL & LOW_32BITS_MASK);

#if defined(NVM_VER_CASE1)
        NVMC_WP1_FLASH_MDF = (uint32_t)(OB_FL_WP_ALL >> WP1_FLASH_OFFSET);
#endif /* NVM_VER_CASE1 */

        /* enable chip erase operation */
        NVMC_ENVM_CTL |= NVMC_ENVM_CTL_CER;
        /* start whole chip erase */
        NVMC_ENVM_CTL |= NVMC_ENVM_CTL_START;
        /* wait for the ENVM ready */
        envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);
        /* wait for the Flash ready */
        flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);
        /* reset the CER bit */
        NVMC_ENVM_CTL &= ~NVMC_ENVM_CTL_CER;

        if((FLASH_READY == flash_state) && (ENVM_READY == envm_state)) {
            status = SUCCESS;
        } else {
            status = ERROR;
        }
    } else {
        status = ERROR;
    }

    return status;
}
#else

/*!
    \brief      erase whole chip (API_ID(0x000BU))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus nvmc_typical_chip_erase(void)
{
    ErrStatus status;
    envm_state_enum envm_state = ENVM_READY;

    /* wait for the ENVM ready */
    envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);

    if(ENVM_READY == envm_state) {
        /* enable chip erase operation */
        NVMC_ENVM_CTL |= NVMC_ENVM_CTL_CER;
        /* start whole chip erase */
        NVMC_ENVM_CTL |= NVMC_ENVM_CTL_START;
        /* wait for the ENVM ready */
        envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);
        /* reset the CER bit */
        NVMC_ENVM_CTL &= ~NVMC_ENVM_CTL_CER;

        if(ENVM_READY == envm_state) {
            status = SUCCESS;
        } else {
            status = ERROR;
        }
    } else {
        status = ERROR;
    }

    return status;
}

/*!
    \brief      erase whole chip, including ENVM and flash, the secure area and dcrp area will also be erased (API_ID(0x000CU))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus nvmc_protection_removed_chip_erase(void)
{
    ErrStatus status;
    envm_state_enum envm_state = ENVM_READY;

    /* wait for the ENVM ready */
    envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);

    if(ENVM_READY == envm_state) {
        NVMC_FLASH_CTL |= NVMC_FLASH_CTL_CHIP_REMOVE_EN;
        /* remove DCRP area */
        NVMC_DCRPADDR_MDF = NVMC_DCRPADDR_MDF_ENVM_DCRP_EREN | INVALID_DCRP_START_ADDR;
        /* remove secure-access area */
        NVMC_SCRADDR_MDF = NVMC_SCRADDR_MDF_ENVM_SCR_EREN | INVALID_SCR_START_ADDR;
        /* disable all sectors' erase/program protection */
        NVMC_WP_ENVM_MDF = OB_ENVM_WP_ALL;

        /* enable chip erase operation */
        NVMC_ENVM_CTL |= NVMC_ENVM_CTL_CER;
        /* start whole chip erase */
        NVMC_ENVM_CTL |= NVMC_ENVM_CTL_START;
        /* wait for the ENVM ready */
        envm_state = nvmc_envm_ready_wait(ENVM_TIMEOUT_COUNT);
        /* reset the CER bit */
        NVMC_ENVM_CTL &= ~NVMC_ENVM_CTL_CER;

        if(ENVM_READY == envm_state) {
            status = SUCCESS;
        } else {
            status = ERROR;
        }
    } else {
        status = ERROR;
    }

    return status;
}
#endif /* NVM_VER_CASE4 */

/*!
    \brief      CRC calculate ENVM data block (API_ID(0x000DU))
    \param[in]  none
    \param[out] crc_value: CRC calculate result
    \retval     state of ENVM
      \arg        ENVM_CRCREADY: ENVM CRC operation has been completed
      \arg        ENVM_CRCBUSY: ENVM CRC operation is in progress
      \arg        ENVM_CRCRERR: ENVM CRC read error
      \arg        ENVM_WPERR: ENVM erase/program protection error
      \arg        ENVM_PGSERR: ENVM program sequence error
      \arg        ENVM_RPERR: ENVM read protection error
      \arg        ENVM_RSERR: ENVM read secure error
      \arg        ENVM_TOERR: ENVM timeout error
*/
envm_state_enum nvmc_envm_crc_calculate(uint32_t *crc_value)
{
    envm_state_enum envm_state = ENVM_CRCREADY;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(crc_value)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x000DU), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* wait for the ENVM CRC ready */
        envm_state = nvmc_envm_crc_ready_wait(ENVM_TIMEOUT_COUNT);

        if(ENVM_CRCREADY == envm_state) {
            /* start CRC calculate */
            NVMC_ENVM_CTL |= NVMC_ENVM_CTL_CRCSTART;
            /* wait for the ENVM ready */
            envm_state = nvmc_envm_crc_ready_wait(ENVM_TIMEOUT_COUNT);

            if(ENVM_CRCREADY == envm_state) {
                *crc_value = NVMC_ENVM_CRCRESULT;
            }
        }
    }
    /* return the ENVM state */
    return envm_state;
}

/*!
    \brief      software trigger ENVM repair (API_ID(0x000EU))
    \param[in]  none
    \param[out] none
    \retval     state of ENVM
      \arg        ENVM_READY: ENVM operation has been completed
      \arg        ENVM_REPAIR_BUSY: ENVM repair operation is in progress
      \arg        ENVM_REPAIR_ECC1CNTIF: ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold
      \arg        ENVM_REPAIR_ECC2CNTIF: ENVM the number of 2 bits error unrepaired is greater than or equal to the threshold
      \arg        ENVM_REPAIR_FLBLANK: ENVM Flash backup content is blank error
      \arg        ENVM_REPAIR_END: ENVM self-repair has been completed
      \arg        ENVM_REPAIR_REPSTRERR: ENVM self-check repair configuration error
      \arg        ENVM_TOERR: ENVM timeout error
*/
envm_state_enum nvmc_envm_repair(void)
{
    envm_state_enum envm_state = ENVM_READY;

