wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
    /* wait for the ENVM repair ready */
    envm_state = nvmc_envm_repair_ready_wait(ENVM_TIMEOUT_COUNT);

    if(ENVM_READY == envm_state) {
        /* start software trigger repair */
        NVMC_ENVM_REPCS |= NVMC_ENVM_REPCS_REPSTART;
        /* wait for the ENVM ready */
        envm_state = nvmc_envm_repair_ready_wait(ENVM_TIMEOUT_COUNT);
    }

    /* return the ENVM state */
    return envm_state;
}

/*!
    \brief      get ENVM read only bad block address that still has the error after self-repair (API_ID(0x000FU))
    \param[in]  index: number of read only bad block (index = 0 - 3)
    \param[out] bad_block_address: bad block address
    \param[out] error_stat: error status after self-check
    \retval     state of bad block address
      \arg        INVLD_ADDRESS_FLAG: the address is invalid
      \arg        VLD_ADDRESS_FLAG: the address is valid
*/
uint8_t nvmc_envm_read_only_bad_block_address_get(uint32_t index, uint32_t *bad_block_address, uint32_t *error_stat)
{
    uint8_t address_stat = INVLD_ADDRESS_FLAG;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BADBLOCK_VALID_ADDRESS_INDEX(index)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x000FU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(bad_block_address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x000FU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(error_stat)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x000FU), ERR_PARAM_POINTER);
    } else
#endif
    {
        *error_stat = ((NVMC_ENVM_ROBBADDRX(index) & NVMC_ENVM_ROBBADDRX_ROBBADDRSTAT) >> ROBBADDRX_ROBBADDRSTAT_OFFSET);
        if(*error_stat) {
            *bad_block_address = NVMC_ENVM_ROBBADDRX(index) & (~NVMC_ENVM_ROBBADDRX_ROBBADDRSTAT);
            /* valid bad block address */
            address_stat = VLD_ADDRESS_FLAG;
        } else {
            *bad_block_address = 0xFFFFFFFFU;
            /* no valid bad block address */
            address_stat = INVLD_ADDRESS_FLAG;
        }
    }
    return address_stat;
}

/*!
    \brief      get ENVM flag set or reset (API_ID(0x0010U))
    \param[in]  envm_flag: ENVM flag
                only one parameter can be selected which is shown as below:
      \arg        ENVM_FLAG_BUSY: ENVM busy flag
      \arg        ENVM_FLAG_ENDF: ENVM end of operation flag
      \arg        ENVM_FLAG_WPERR: ENVM write protection error flag
      \arg        ENVM_FLAG_PGSERR: ENVM program sequence error flag
      \arg        ENVM_FLAG_OTAFAIL: ENVM OTA update, check_bootloader check failure flag
      \arg        ENVM_FLAG_OTASUC: ENVM OTA update, check_bootloader check success flag
      \arg        ENVM_FLAG_COPYSTRERR: ENVM copy startup failure error flag
      \arg        ENVM_FLAG_RPERR: ENVM read protection error flag
      \arg        ENVM_FLAG_RSERR: ENVM read secure error flag
      \arg        ENVM_FLAG_AUTOECCSERRDET: ENVM one bit detect error flag
      \arg        ENVM_FLAG_AUTOECCDERRDET: ENVM two bits detect error flag
      \arg        ENVM_FLAG_CRCCALEND: ENVM CRC end of calculation flag
      \arg        ENVM_FLAG_CRCRERR: ENVM CRC read error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_envm_flag_get(uint32_t envm_flag)
{
    FlagStatus reval = RESET;

    if(NVMC_ENVM_STAT & envm_flag) {
        reval = SET;
    }
    /* return the state of corresponding ENVM flag */
    return reval;
}

/*!
    \brief      clear ENVM flag (API_ID(0x0011U))
    \param[in]  envm_flag: ENVM flag
                one or more parameters can be selected which is shown as below:
      \arg        ENVM_FLAG_ENDF: ENVM end of operation flag
      \arg        ENVM_FLAG_WPERR: ENVM write protection error flag
      \arg        ENVM_FLAG_PGSERR: ENVM program sequence error flag
      \arg        ENVM_FLAG_OTAFAIL: ENVM OTA update, check_bootloader check failure flag
      \arg        ENVM_FLAG_OTASUC: ENVM OTA update, check_bootloader check success flag
      \arg        ENVM_FLAG_COPYSTRERR: ENVM copy startup failure error flag
      \arg        ENVM_FLAG_RPERR: ENVM read protection error flag
      \arg        ENVM_FLAG_RSERR: ENVM read secure error flag
      \arg        ENVM_FLAG_CRCCALEND: ENVM CRC end of calculation flag
      \arg        ENVM_FLAG_CRCRERR: ENVM CRC read error flag
    \param[out] none
    \retval     none
*/
void nvmc_envm_flag_clear(uint32_t envm_flag)
{
    uint32_t reg_value;

    reg_value = NVMC_ENVM_STAT;
    reg_value &= ~(ENVM_FLAG_ENDF | ENVM_FLAG_WPERR | ENVM_FLAG_PGSERR | ENVM_FLAG_OTAFAIL | ENVM_FLAG_OTASUC | ENVM_FLAG_COPYSTRERR | ENVM_FLAG_RPERR |
                   ENVM_FLAG_RSERR | ENVM_FLAG_CRCCALEND | ENVM_FLAG_CRCRERR);
    reg_value |= envm_flag;

    /* clear the flags */
    NVMC_ENVM_STAT = reg_value;
}

/*!
    \brief      enable ENVM interrupt (API_ID(0x0012U))
    \param[in]  envm_int: the ENVM interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        ENVM_INT_ENDIE: ENVM end of operation interrupt enable bit
      \arg        ENVM_INT_WPERRIE: ENVM write protection error interrupt enable bit
      \arg        ENVM_INT_PGSERRIE: ENVM program sequence error interrupt enable bit
      \arg        ENVM_INT_RPERRIE: ENVM read protection error interrupt enable bit
      \arg        ENVM_INT_RSERRIE: ENVM read secure error interrupt enable bit
      \arg        ENVM_INT_AUTOECCSERRDETIE: ENVM one bit detect error interrupt enable bit
      \arg        ENVM_INT_AUTOECCDERRDETIE: ENVM two bits detect error interrupt enable bit
      \arg        ENVM_INT_CRCCALENDIE: ENVM CRC end of calculation interrupt enable bit
      \arg        ENVM_INT_CRCRERRIE: ENVM CRC read error interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_envm_interrupt_enable(uint32_t envm_int)
{
    NVMC_ENVM_CTL |= envm_int;
}

/*!
    \brief      disable ENVM interrupt (API_ID(0x0013U))
    \param[in]  envm_int: the ENVM interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        ENVM_INT_ENDIE: ENVM end of operation interrupt enable bit
      \arg        ENVM_INT_WPERRIE: ENVM write protection error interrupt enable bit
      \arg        ENVM_INT_PGSERRIE: ENVM program sequence error interrupt enable bit
      \arg        ENVM_INT_RPERRIE: ENVM read protection error interrupt enable bit
      \arg        ENVM_INT_RSERRIE: ENVM read secure error interrupt enable bit
      \arg        ENVM_INT_AUTOECCSERRDETIE: ENVM one bit detect error interrupt enable bit
      \arg        ENVM_INT_AUTOECCDERRDETIE: ENVM two bits detect error interrupt enable bit
      \arg        ENVM_INT_CRCCALENDIE: ENVM CRC end of calculation interrupt enable bit
      \arg        ENVM_INT_CRCRERRIE: ENVM CRC read error interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_envm_interrupt_disable(uint32_t envm_int)
{
    NVMC_ENVM_CTL &= ~(uint32_t)envm_int;
}

/*!
    \brief      get ENVM interrupt flag status (API_ID(0x0014U))
    \param[in]  envm_int_flag: ENVM interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        ENVM_INT_FLAG_ENDF: ENVM end of operation interrupt flag
      \arg        ENVM_INT_FLAG_WPERR: ENVM write protection error interrupt flag
      \arg        ENVM_INT_FLAG_PGSERR: ENVM program sequence error interrupt flag
      \arg        ENVM_INT_FLAG_RPERR: ENVM read protection error interrupt flag
      \arg        ENVM_INT_FLAG_RSERR: ENVM read secure error interrupt flag
      \arg        ENVM_INT_FLAG_AUTOECCSERRDET: ENVM one bit detect error interrupt flag
      \arg        ENVM_INT_FLAG_AUTOECCDERRDET: ENVM two bits detect error interrupt flag
      \arg        ENVM_INT_FLAG_CRCCALEND: ENVM CRC end of calculation interrupt flag
      \arg        ENVM_INT_FLAG_CRCRERR: ENVM CRC read error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_envm_interrupt_flag_get(uint8_t envm_int_flag)
{
    FlagStatus reval = RESET;

    uint32_t reg1 = NVMC_ENVM_STAT;
    uint32_t reg2 = NVMC_ENVM_CTL;

    switch(envm_int_flag) {
    /* ENVM end of operation interrupt */
    case ENVM_INT_FLAG_ENDF:
        reg1 = reg1 & NVMC_ENVM_STAT_ENDF;
        reg2 = reg2 & NVMC_ENVM_CTL_ENDIE;
        break;
    /* ENVM write protection error interrupt */
    case ENVM_INT_FLAG_WPERR:
        reg1 = reg1 & NVMC_ENVM_STAT_WPERR;
        reg2 = reg2 & NVMC_ENVM_CTL_WPERRIE;
        break;
    /* ENVM program sequence error interrupt */
    case ENVM_INT_FLAG_PGSERR:
        reg1 = reg1 & NVMC_ENVM_STAT_PGSERR;
        reg2 = reg2 & NVMC_ENVM_CTL_PGSERRIE;
        break;
    /* ENVM read protection error interrupt */
    case ENVM_INT_FLAG_RPERR:
        reg1 = reg1 & NVMC_ENVM_STAT_RPERR;
        reg2 = reg2 & NVMC_ENVM_CTL_RPERRIE;
        break;
    /* ENVM read secure error interrupt */
    case ENVM_INT_FLAG_RSERR:
        reg1 = reg1 & NVMC_ENVM_STAT_RSERR;
        reg2 = reg2 & NVMC_ENVM_CTL_RSERRIE;
        break;
    /* ENVM one bit detect error interrupt */
    case ENVM_INT_FLAG_AUTOECCSERRDET:
        reg1 = reg1 & NVMC_ENVM_STAT_AUTOECCSERRDET;
        reg2 = reg2 & NVMC_ENVM_CTL_AUTOECCSERRDETIE;
        break;
    /* ENVM two bits detect error interrupt */
    case ENVM_INT_FLAG_AUTOECCDERRDET:
        reg1 = reg1 & NVMC_ENVM_STAT_AUTOECCDERRDET;
        reg2 = reg2 & NVMC_ENVM_CTL_AUTOECCDERRDETIE;
        break;
    /* ENVM CRC end of calculation interrupt */
    case ENVM_INT_FLAG_CRCCALEND:
        reg1 = reg1 & NVMC_ENVM_STAT_CRCENDCAL;
        reg2 = reg2 & NVMC_ENVM_CTL_CRCENDCALIE;
        break;
    /* ENVM CRC read error interrupt */
    case ENVM_INT_FLAG_CRCRERR:
        reg1 = reg1 & NVMC_ENVM_STAT_CRCRERR;
        reg2 = reg2 & NVMC_ENVM_CTL_CRCRERRIE;
        break;
    default :
        break;
    }
    /*get ENVM interrupt flag status */
    if((0U != reg1) && (0U != reg2)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear ENVM interrupt flag status (API_ID(0x0015U))
    \param[in]  envm_int_flag: ENVM interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        ENVM_INT_FLAG_ENDF: ENVM end of operation interrupt flag
      \arg        ENVM_INT_FLAG_WPERR: ENVM write protection error interrupt flag
      \arg        ENVM_INT_FLAG_PGSERR: ENVM program sequence error interrupt flag
      \arg        ENVM_INT_FLAG_RPERR: ENVM read protection error interrupt flag
      \arg        ENVM_INT_FLAG_RSERR: ENVM read secure error interrupt flag
      \arg        ENVM_INT_FLAG_CRCCALEND: ENVM CRC end of calculation interrupt flag
      \arg        ENVM_INT_FLAG_CRCRERR: ENVM CRC read error interrupt flag
    \param[out] none
    \retval     none
*/
void nvmc_envm_interrupt_flag_clear(uint8_t envm_int_flag)
{

    switch(envm_int_flag) {
    /* ENVM end of operation interrupt */
    case ENVM_INT_FLAG_ENDF:
        NVMC_ENVM_STAT |= NVMC_ENVM_STAT_ENDF;
        break;
    /* ENVM write protection error interrupt */
    case ENVM_INT_FLAG_WPERR:
        NVMC_ENVM_STAT |= NVMC_ENVM_STAT_WPERR;
        break;
    /* ENVM program sequence error interrupt */
    case ENVM_INT_FLAG_PGSERR:
        NVMC_ENVM_STAT |= NVMC_ENVM_STAT_PGSERR;
        break;
    /* ENVM read protection error interrupt */
    case ENVM_INT_FLAG_RPERR:
        NVMC_ENVM_STAT |= NVMC_ENVM_STAT_RPERR;
        break;
    /* ENVM read secure error interrupt */
    case ENVM_INT_FLAG_RSERR:
        NVMC_ENVM_STAT |= NVMC_ENVM_STAT_RSERR;
        break;
    /* ENVM CRC end of calculation interrupt */
    case ENVM_INT_FLAG_CRCCALEND:
        NVMC_ENVM_STAT |= NVMC_ENVM_STAT_CRCENDCAL;
        break;
    /* ENVM CRC read error interrupt */
    case ENVM_INT_FLAG_CRCRERR:
        NVMC_ENVM_STAT |= NVMC_ENVM_STAT_CRCRERR;
        break;
    default :
        break;
    }
}

/*!
    \brief      get ENVM repair flag set or reset (API_ID(0x0016U))
    \param[in]  envm_flag: ENVM flag
                only one parameter can be selected which is shown as below:
      \arg        ENVM_FLAG_NMIERRINT: ENVM AXI read, repair failure with 3-bit error flag
      \arg        ENVM_FLAG_REPAIR_ECC1CNTIF: ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold flag
      \arg        ENVM_FLAG_REPAIR_ECC2CNTIF: ENVM the number of 2 bits error unrepaired is greater than or equal to the threshold flag
      \arg        ENVM_FLAG_REPAIR_FLBLANK: ENVM Flash backup content is blank flag
      \arg        ENVM_FLAG_REPAIR_END: ENVM self-repair end flag
      \arg        ENVM_FLAG_REPAIR_REPSTRERR: ENVM self-check repair configuration error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_envm_repair_flag_get(uint32_t envm_repair_flag)
{
    FlagStatus reval = RESET;

    if(NVMC_ENVM_REPCS & envm_repair_flag) {
        reval = SET;
    }
    /* return the state of corresponding ENVM flag */
    return reval;
}

/*!
    \brief      clear ENVM repair flag (API_ID(0x0017U))
    \param[in]  envm_flag: ENVM flag
                one or more parameters can be selected which is shown as below:
      \arg        ENVM_FLAG_NMIERRINT: ENVM AXI read, repair failure with 3-bit error flag
      \arg        ENVM_FLAG_REPAIR_ECC1CNTIF: ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold flag
      \arg        ENVM_FLAG_REPAIR_ECC2CNTIF: ENVM the number of 2 bits error unrepaired is greater than or equal to the threshold flag
      \arg        ENVM_FLAG_REPAIR_FLBLANK: ENVM Flash backup content is blank flag
      \arg        ENVM_FLAG_REPAIR_END: ENVM self-repair end flag
      \arg        ENVM_FLAG_REPAIR_REPSTRERR: ENVM self-check repair configuration error flag
    \param[out] none
    \retval     none
*/
void nvmc_envm_repair_flag_clear(uint32_t envm_repair_flag)
{
    uint32_t reg_value;

    reg_value = NVMC_ENVM_REPCS;
    reg_value &= ~(ENVM_FLAG_NMIERRINT | ENVM_FLAG_REPAIR_ECC1CNTIF | ENVM_FLAG_REPAIR_ECC2CNTIF | ENVM_FLAG_REPAIR_FLBLANK | ENVM_FLAG_REPAIR_END |
                   ENVM_FLAG_REPAIR_REPSTRERR);
    reg_value |= envm_repair_flag;

    /* clear the flags */
    NVMC_ENVM_REPCS = reg_value;
}

/*!
    \brief      enable ENVM repair interrupt (API_ID(0x0018U))
    \param[in]  envm_repair_int: the ENVM repair interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        ENVM_INT_REPAIR_ECC1CNTIE: ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold interrupt enable bit
      \arg        ENVM_INT_REPAIR_ECC2CNTIE: ENVM the number of 2 bits error unrepaired is greater than or equal to the threshold interrupt enable bit
      \arg        ENVM_INT_REPAIR_FLBLANKIE: ENVM Flash backup content is blank interrupt enable bit
      \arg        ENVM_INT_REPAIR_DONEIE: ENVM self-repair done interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_envm_repair_interrupt_enable(uint32_t envm_repair_int)
{
    uint32_t reg;

