wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
    reg = NVMC_ENVM_REPCS;
    reg &= ~(NVMC_ENVM_REPCS_ECC2CNTIF | NVMC_ENVM_REPCS_ECC1CNTIF | NVMC_ENVM_REPCS_FLBLANK | NVMC_ENVM_REPCS_NMIERRINT | NVMC_ENVM_REPCS_REPEND |
             NVMC_ENVM_REPCS_REPSTRERR);
    reg |= (uint32_t)envm_repair_int;
    NVMC_ENVM_REPCS = reg;
}

/*!
    \brief      disable ENVM repair interrupt (API_ID(0x0019U))
    \param[in]  envm_repair_int: the ENVM repair interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        ENVM_INT_REPAIR_ECC1CNTIE: ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold interrupt enable bit
      \arg        ENVM_INT_REPAIR_ECC2CNTIE: ENVM the number of 2 bits error unrepaired is greater than or equal to the threshold interrupt enable bit
      \arg        ENVM_INT_REPAIR_FLBLANKIE: ENVM Flash backup content is blank interrupt enable bit
      \arg        ENVM_INT_REPAIR_DONEIE: ENVM self-repair done interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_envm_repair_interrupt_disable(uint32_t envm_repair_int)
{
    uint32_t reg;

    reg = NVMC_ENVM_REPCS;
    reg &= ~(NVMC_ENVM_REPCS_ECC2CNTIF | NVMC_ENVM_REPCS_ECC1CNTIF | NVMC_ENVM_REPCS_FLBLANK | NVMC_ENVM_REPCS_NMIERRINT | NVMC_ENVM_REPCS_REPEND |
             NVMC_ENVM_REPCS_REPSTRERR);
    reg &= ~(uint32_t)envm_repair_int;
    NVMC_ENVM_REPCS = reg;
}

/*!
    \brief      get ENVM repair interrupt flag status (API_ID(0x001AU))
    \param[in]  envm_repair_int_flag: ENVM repair interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        ENVM_INT_FLAG_REPAIR_ECC1CNTIF: ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold interrupt flag
      \arg        ENVM_INT_FLAG_REPAIR_ECC2CNTIF: ENVM the number of 2 bit error unrepaired is greater than or equal to the threshold interrupt flag
      \arg        ENVM_INT_FLAG_REPAIR_FLBLANK: ENVM Flash backup content is blank interrupt flag
      \arg        ENVM_INT_FLAG_REPAIR_END: ENVM self-repair end interrupt flag
      \arg        ENVM_INT_FLAG_REPAIR_REPSTRERR: ENVM self-check repair configuration error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_envm_repair_interrupt_flag_get(uint8_t envm_repair_int_flag)
{
    FlagStatus reval = RESET;

    uint32_t reg1 = NVMC_ENVM_REPCS;
    uint32_t reg2 = NVMC_ENVM_REPCS;

    switch(envm_repair_int_flag) {
    /* ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold interrupt */
    case ENVM_INT_FLAG_REPAIR_ECC1CNTIF:
        reg1 = reg1 & NVMC_ENVM_REPCS_ECC1CNTIF;
        reg2 = reg2 & NVMC_ENVM_REPCS_ECC1CNTIE;
        break;
    /* ENVM the number of 2 bit error unrepaired is greater than or equal to the threshold interrupt */
    case ENVM_INT_FLAG_REPAIR_ECC2CNTIF:
        reg1 = reg1 & NVMC_ENVM_REPCS_ECC2CNTIF;
        reg2 = reg2 & NVMC_ENVM_REPCS_ECC2CNTIE;
        break;
    /* ENVM Flash backup content is blank interrupt */
    case ENVM_INT_FLAG_REPAIR_FLBLANK:
        reg1 = reg1 & NVMC_ENVM_REPCS_FLBLANK;
        reg2 = reg2 & NVMC_ENVM_REPCS_FLBLANKIE;
        break;
    /* ENVM self-repair end interrupt */
    case ENVM_INT_FLAG_REPAIR_END:
        reg1 = reg1 & NVMC_ENVM_REPCS_REPEND;
        reg2 = reg2 & NVMC_ENVM_REPCS_REPDONEIE;
        break;
    /* ENVM self-check repair configuration error interrupt */
    case ENVM_INT_FLAG_REPAIR_REPSTRERR:
        reg1 = reg1 & NVMC_ENVM_REPCS_REPSTRERR;
        reg2 = reg2 & NVMC_ENVM_REPCS_REPDONEIE;
        break;
    default :
        break;
    }
    /*get ENVM repair interrupt flag status */
    if((0U != reg1) && (0U != reg2)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear ENVM repair interrupt flag status (API_ID(0x001BU))
    \param[in]  envm_repair_int_flag: ENVM repair interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        ENVM_INT_FLAG_REPAIR_ECC1CNTIF: ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold interrupt flag
      \arg        ENVM_INT_FLAG_REPAIR_ECC2CNTIF: ENVM the number of 2 bit error unrepaired is greater than or equal to the threshold interrupt flag
      \arg        ENVM_INT_FLAG_REPAIR_FLBLANK: ENVM Flash backup content is blank interrupt flag
      \arg        ENVM_INT_FLAG_REPAIR_END: ENVM self-repair end interrupt flag
      \arg        ENVM_INT_FLAG_REPAIR_REPSTRERR: ENVM self-check repair configuration error interrupt flag
    \param[out] none
    \retval     none
*/
void nvmc_envm_repair_interrupt_flag_clear(uint8_t envm_repair_int_flag)
{

    switch(envm_repair_int_flag) {
    /* ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold interrupt */
    case ENVM_INT_FLAG_REPAIR_ECC1CNTIF:
        NVMC_ENVM_REPCS |= NVMC_ENVM_REPCS_ECC1CNTIF;
        break;
    /* ENVM the number of 2 bit error unrepaired is greater than or equal to the threshold interrupt */
    case ENVM_INT_FLAG_REPAIR_ECC2CNTIF:
        NVMC_ENVM_REPCS |= NVMC_ENVM_REPCS_ECC2CNTIF;
        break;
    /* ENVM Flash backup content is blank interrupt */
    case ENVM_INT_FLAG_REPAIR_FLBLANK:
        NVMC_ENVM_REPCS |= NVMC_ENVM_REPCS_FLBLANK;
        break;
    /* ENVM self-repair end interrupt */
    case ENVM_INT_FLAG_REPAIR_END:
        NVMC_ENVM_REPCS |= NVMC_ENVM_REPCS_REPEND;
        break;
    /* ENVM self-check repair configuration error interrupt */
    case ENVM_INT_FLAG_REPAIR_REPSTRERR:
        NVMC_ENVM_REPCS |= NVMC_ENVM_REPCS_REPSTRERR;
        break;
    default :
        break;
    }

}

/*!
    \brief      get the number of 2 bit error occurrences without repair during the self-check (API_ID(0x001CU))
    \param[in]  none
    \param[out] none
    \retval     the number of 2 bit error
*/
uint8_t nvmc_envm_ecc2_cnt_without_repair_get(void)
{
    return (uint8_t)((NVMC_ENVM_REPCS & NVMC_ENVM_REPCS_ERR2CNT) >> ENVM_REPCS_ERR2CNT_OFFSET);
}

/*!
    \brief      get the number of 1 bit error occurrences without repair during the self-check (API_ID(0x001DU))
    \param[in]  none
    \param[out] none
    \retval     the number of 1 bit error
*/
uint8_t nvmc_envm_ecc1_cnt_without_repair_get(void)
{
    return (uint8_t)((NVMC_ENVM_REPCS & NVMC_ENVM_REPCS_ERR1CNT) >> ENVM_REPCS_ERR1CNT_OFFSET);
}

/*!
    \brief      get the number of error count fail to repair during self-check (API_ID(0x001EU))
    \param[in]  none
    \param[out] none
    \retval     the number of error count fail to repair
*/
uint8_t nvmc_envm_robbcnt_get(void)
{
    return (uint8_t)((NVMC_ENVM_REPCS & NVMC_ENVM_REPCS_ROBBCNT) >> ENVM_REPCS_ROBBCNT_OFFSET);
}

/*!
    \brief      get the error status during self-check (API_ID(0x001FU))
    \param[in]  none
    \param[out] none
    \retval     the error status
*/
uint8_t nvmc_envm_repair_error_status_get(void)
{
    return (uint8_t)((NVMC_ENVM_REPCS & NVMC_ENVM_REPCS_REPERRSTAT) >> ENVM_REPCS_REPERRSTAT_OFFSET);
}

/*!
    \brief      clear the number of 2 bit error occurrences without repair during self-check (API_ID(0x0020U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_envm_ecc2_cnt_without_repair_clear(void)
{
    uint32_t reg_value;

    reg_value = NVMC_ENVM_REPCS;
    /* keep repair flag unchanged */
    reg_value &= ~(ENVM_FLAG_NMIERRINT | ENVM_FLAG_REPAIR_ECC1CNTIF | ENVM_FLAG_REPAIR_ECC2CNTIF | ENVM_FLAG_REPAIR_FLBLANK | ENVM_FLAG_REPAIR_END |
                   ENVM_FLAG_REPAIR_REPSTRERR);
    reg_value &= ~NVMC_ENVM_REPCS_ERR2CNT;

