wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
    /* clear the err2cnt */
    NVMC_ENVM_REPCS = reg_value;
}

/*!
    \brief      clear the number of 1 bit error occurrences without repair during self-check (API_ID(0x0021U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_envm_ecc1_cnt_without_repair_clear(void)
{
    uint32_t reg_value;

    reg_value = NVMC_ENVM_REPCS;
    /* keep repair flag unchanged */
    reg_value &= ~(ENVM_FLAG_NMIERRINT | ENVM_FLAG_REPAIR_ECC1CNTIF | ENVM_FLAG_REPAIR_ECC2CNTIF | ENVM_FLAG_REPAIR_FLBLANK | ENVM_FLAG_REPAIR_END |
                   ENVM_FLAG_REPAIR_REPSTRERR);
    reg_value &= ~NVMC_ENVM_REPCS_ERR1CNT;

    /* clear the err1cnt */
    NVMC_ENVM_REPCS = reg_value;
}

/*!
    \brief      clear the number of error count fail to repair during self-check (API_ID(0x0022U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_envm_robbcnt_clear(void)
{
    uint32_t reg_value;

    reg_value = NVMC_ENVM_REPCS;
    /* keep repair flag unchanged */
    reg_value &= ~(ENVM_FLAG_NMIERRINT | ENVM_FLAG_REPAIR_ECC1CNTIF | ENVM_FLAG_REPAIR_ECC2CNTIF | ENVM_FLAG_REPAIR_FLBLANK | ENVM_FLAG_REPAIR_END |
                   ENVM_FLAG_REPAIR_REPSTRERR);
    reg_value &= ~NVMC_ENVM_REPCS_ROBBCNT;

    /* clear the robbcnt */
    NVMC_ENVM_REPCS = reg_value;
}

/*!
    \brief      clear error status during self-check (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_envm_repair_error_status_clear(void)
{
    uint32_t reg_value;

    reg_value = NVMC_ENVM_REPCS;
    /* keep repair flag unchanged */
    reg_value &= ~(ENVM_FLAG_NMIERRINT | ENVM_FLAG_REPAIR_ECC1CNTIF | ENVM_FLAG_REPAIR_ECC2CNTIF | ENVM_FLAG_REPAIR_FLBLANK | ENVM_FLAG_REPAIR_END |
                   ENVM_FLAG_REPAIR_REPSTRERR);
    reg_value &= ~NVMC_ENVM_REPCS_REPERRSTAT;

    /* clear the repair status */
    NVMC_ENVM_REPCS = reg_value;
}

/*!
    \brief      clear the result of repair during self-check, including counter, error address, and status (API_ID(0x0024U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_envm_self_check_repair_flag_clear(void)
{
    uint32_t reg_value;

    reg_value = NVMC_ENVM_CTL;
    reg_value |= NVMC_ENVM_CTL_REPRESC;

    /* clear the flags */
    NVMC_ENVM_CTL = reg_value;
}

/*!
    \brief      clear the result of repair during ENVM axi read, including counter, error address, and status (API_ID(0x0025U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_envm_axi_read_repair_flag_clear(void)
{
    uint32_t reg_value;

    reg_value = NVMC_ENVM_CTL;
    reg_value |= NVMC_ENVM_CTL_AUTOREPRESC;

    /* clear the flags */
    NVMC_ENVM_CTL = reg_value;
}

/*!
    \brief      get ENVM state (exclude ENVM crc operation) (API_ID(0x0026U))
    \param[in]  none
    \param[out] none
    \retval     state of ENVM
      \arg        ENVM_READY: ENVM operation has been completed
      \arg        ENVM_BUSY: ENVM operation is in progress
      \arg        ENVM_WPERR: ENVM erase/program protection error
      \arg        ENVM_PGSERR: ENVM program sequence error
      \arg        ENVM_RPERR: ENVM read protection error
      \arg        ENVM_RSERR: ENVM read secure error
*/
static envm_state_enum nvmc_envm_state_get(void)
{
    envm_state_enum envm_state = ENVM_READY;

    if(ENVM_FLAG_BUSY == (NVMC_ENVM_STAT & ENVM_FLAG_BUSY)) {
        envm_state = ENVM_BUSY;
    } else if(RESET != (NVMC_ENVM_STAT & ENVM_FLAG_WPERR)) {
        envm_state = ENVM_WPERR;
    } else if(RESET != (NVMC_ENVM_STAT & ENVM_FLAG_RSERR)) {
        envm_state = ENVM_RSERR;
    } else if(RESET != (NVMC_ENVM_STAT & ENVM_FLAG_RPERR)) {
        envm_state = ENVM_RPERR;
    } else if(RESET != (NVMC_ENVM_STAT & ENVM_FLAG_PGSERR)) {
        envm_state = ENVM_PGSERR;
    } else {
        envm_state = ENVM_READY;
    }

    /* return the ENVM state */
    return envm_state;
}

/*!
    \brief      check whether ENVM is ready or not (exclude ENVM crc operation) (API_ID(0x0027U))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of ENVM
      \arg        ENVM_READY: ENVM operation has been completed
      \arg        ENVM_BUSY: ENVM operation is in progress
      \arg        ENVM_WPERR: ENVM erase/program protection error
      \arg        ENVM_PGSERR: ENVM program sequence error
      \arg        ENVM_RPERR: ENVM read protection error
      \arg        ENVM_RSERR: ENVM read secure error
      \arg        ENVM_TOERR: ENVM timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static envm_state_enum nvmc_envm_ready_wait(uint32_t timeout)
{
    envm_state_enum envm_state = ENVM_BUSY;

    /* wait for ENVM ready */
    do {
        /* get ENVM state */
        envm_state = nvmc_envm_state_get();
        timeout--;
    } while((ENVM_BUSY == envm_state) && (0U != timeout));

    if(ENVM_BUSY == envm_state) {
        envm_state = ENVM_TOERR;
    }
    /* return the ENVM state */
    return envm_state;
}

/*!
    \brief      get ENVM crc state (API_ID(0x0028U))
    \param[in]  none
    \param[out] none
    \retval     state of ENVM
      \arg        ENVM_CRCREADY: ENVM CRC operation has been completed
      \arg        ENVM_CRCBUSY: ENVM CRC operation is in progress
      \arg        ENVM_CRCRERR: ENVM CRC read error
      \arg        ENVM_WPERR: ENVM erase/program protection error
      \arg        ENVM_PGSERR: ENVM program sequence error
      \arg        ENVM_RPERR: ENVM read protection error
      \arg        ENVM_RSERR: ENVM read secure error
*/
static envm_state_enum nvmc_envm_crc_state_get(void)
{
    envm_state_enum envm_state = ENVM_CRCREADY;

    if(ENVM_FLAG_CRCBUSY == (NVMC_ENVM_STAT & ENVM_FLAG_CRCBUSY)) {
        envm_state = ENVM_CRCBUSY;
    } else if(RESET != (NVMC_ENVM_STAT & ENVM_FLAG_WPERR)) {
        envm_state = ENVM_WPERR;
    } else if(RESET != (NVMC_ENVM_STAT & ENVM_FLAG_RSERR)) {
        envm_state = ENVM_RSERR;
    } else if(RESET != (NVMC_ENVM_STAT & ENVM_FLAG_RPERR)) {
        envm_state = ENVM_RPERR;
    } else if(RESET != (NVMC_ENVM_STAT & ENVM_FLAG_PGSERR)) {
        envm_state = ENVM_PGSERR;
    } else if(RESET != (NVMC_ENVM_STAT & ENVM_FLAG_CRCRERR)) {
        envm_state = ENVM_CRCRERR;
    } else {
        envm_state = ENVM_CRCREADY;
    }

    /* return the ENVM state */
    return envm_state;
}

/*!
    \brief      check whether ENVM crc is ready or not (API_ID(0x0029U))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of ENVM
      \arg        ENVM_CRCREADY: ENVM CRC operation has been completed
      \arg        ENVM_CRCBUSY: ENVM CRC operation is in progress
      \arg        ENVM_CRCRERR: ENVM CRC read error
      \arg        ENVM_WPERR: ENVM erase/program protection error
      \arg        ENVM_PGSERR: ENVM program sequence error
      \arg        ENVM_RPERR: ENVM read protection error
      \arg        ENVM_RSERR: ENVM read secure error
      \arg        ENVM_TOERR: ENVM timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static envm_state_enum nvmc_envm_crc_ready_wait(uint32_t timeout)
{
    envm_state_enum envm_state = ENVM_CRCBUSY;

    /* wait for ENVM ready */
    do {
        /* get ENVM state */
        envm_state = nvmc_envm_crc_state_get();
        timeout--;
    } while((ENVM_CRCBUSY == envm_state) && (0U != timeout));

    if(ENVM_CRCBUSY == envm_state) {
        envm_state = ENVM_TOERR;
    }
    /* return the ENVM state */
    return envm_state;
}

/*!
    \brief      get ENVM repair state (API_ID(0x002AU))
    \param[in]  none
    \param[out] none
    \retval     state of ENVM
      \arg        ENVM_READY: ENVM operation has been completed
      \arg        ENVM_REPAIR_BUSY: ENVM repair operation is in progress
      \arg        ENVM_REPAIR_ECC1CNTIF: ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold
      \arg        ENVM_REPAIR_ECC2CNTIF: ENVM the number of 2 bits error unrepaired is greater than or equal to the threshold
      \arg        ENVM_REPAIR_FLBLANK: ENVM Flash backup content is blank error
      \arg        ENVM_REPAIR_END: ENVM self-repair has been completed
      \arg        ENVM_REPAIR_REPSTRERR: ENVM self-check repair configuration error
*/
static envm_state_enum nvmc_envm_repair_state_get(void)
{
    envm_state_enum envm_state = ENVM_READY;

    if(RESET != (NVMC_ENVM_REPCS & NVMC_ENVM_REPCS_REPSTART)) {
        envm_state = ENVM_REPAIR_BUSY;
    } else if(RESET != (NVMC_ENVM_REPCS & ENVM_FLAG_REPAIR_ECC1CNTIF)) {
        envm_state = ENVM_REPAIR_ECC1CNTIF;
    } else if(RESET != (NVMC_ENVM_REPCS & ENVM_FLAG_REPAIR_ECC2CNTIF)) {
        envm_state = ENVM_REPAIR_ECC2CNTIF;
    } else if(RESET != (NVMC_ENVM_REPCS & ENVM_FLAG_REPAIR_FLBLANK)) {
        envm_state = ENVM_REPAIR_FLBLANK;
    } else if(RESET != (NVMC_ENVM_REPCS & ENVM_FLAG_REPAIR_REPSTRERR)) {
        envm_state = ENVM_REPAIR_REPSTRERR;
    } else {
        envm_state = ENVM_READY;
    }

    /* return the ENVM state */
    return envm_state;
}

/*!
    \brief      check whether ENVM repair is ready or not (API_ID(0x002BU))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of ENVM
      \arg        ENVM_READY: ENVM operation has been completed
      \arg        ENVM_REPAIR_BUSY: ENVM repair operation is in progress
      \arg        ENVM_REPAIR_ECC1CNTIF: ENVM the number of 1 bit error unrepaired is greater than or equal to the threshold
      \arg        ENVM_REPAIR_ECC2CNTIF: ENVM the number of 2 bits error unrepaired is greater than or equal to the threshold
      \arg        ENVM_REPAIR_FLBLANK: ENVM Flash backup content is blank error
      \arg        ENVM_REPAIR_END: ENVM self-repair has been completed
      \arg        ENVM_REPAIR_REPSTRERR: ENVM self-check repair configuration error
      \arg        ENVM_TOERR: ENVM timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static envm_state_enum nvmc_envm_repair_ready_wait(uint32_t timeout)
{
    envm_state_enum envm_state = ENVM_REPAIR_BUSY;

    /* wait for ENVM ready */
    do {
        /* get ENVM state */
        envm_state = nvmc_envm_repair_state_get();
        timeout--;
    } while((ENVM_REPAIR_BUSY == envm_state) && (0U != timeout));

    if(ENVM_REPAIR_BUSY == envm_state) {
        envm_state = ENVM_TOERR;
    }
    /* return the ENVM state */
    return envm_state;
}

/*!
    \brief      unlock register NVMC_FLASH_CTL (API_ID(0x002CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_flash_unlock(void)
{
    if((RESET != (NVMC_FLASH_CTL & NVMC_FLASH_CTL_LK))) {
        /* write the flash key */
        NVMC_FLASH_KEY = UNLOCK_KEY0;
        NVMC_FLASH_KEY = UNLOCK_KEY1;
    }
}

/*!
    \brief      lock register NVMC_FLASH_CTL (API_ID(0x002DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_flash_lock(void)
{
    /* set the LK bit*/
    NVMC_FLASH_CTL |= NVMC_FLASH_CTL_LK;
}

/*!
    \brief      program a double-word at the corresponding address (API_ID(0x002EU))
    \param[in]  address: address to program (case1: 0x08200000U - 0x0897FFFF, case2 and case3:0x08200000U - 0x0857FFFF)
    \param[in]  data: double word to program
    \param[out] none
    \retval     state of flash
      \arg        FLASH_READY: flash operation has been completed
      \arg        FLASH_BUSY: flash operation is in progress
      \arg        FLASH_WPERR: flash erase/program protection error
      \arg        FLASH_PGSERR: flash program sequence error
      \arg        FLASH_RPERR: flash read protection error
      \arg        FLASH_RSERR: flash read secure error
      \arg        FLASH_TOERR: flash timeout error
*/
flash_state_enum nvmc_flash_doubleword_program(uint32_t address, uint64_t data)
{
    flash_state_enum flash_state = FLASH_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_FLASH_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x002EU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* wait for the flash ready */
        flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);

