wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
        if(FLASH_READY == flash_state) {
            /* set flash program size */
            NVMC_PERFCTL &= ~NVMC_PERFCTL_FLASH_PG_SZ;
            NVMC_PERFCTL |= FLASH_PROG_SIZE_8BYTES;
            /* set the PG bit to start program */
            NVMC_FLASH_CTL |= NVMC_FLASH_CTL_PG;

            __ISB();
            __DSB();

            REG64(address) = data;

            __ISB();
            __DSB();

            /* wait for the flash ready */
            flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);
            /* reset the PG bit */
            NVMC_FLASH_CTL &= ~NVMC_FLASH_CTL_PG;
        }
    }
    /* return the flash state */
    return flash_state;
}

/*!
    \brief      program 32 bytes at the corresponding flash address (API_ID(0x002FU))
    \param[in]  address: address to program (case1: 0x08200000U - 0x0897FFFF, case2 and case3:0x08200000U - 0x0857FFFF)
    \param[in]  data: data buffer to program
    \param[out] none
    \retval     state of flash
      \arg        FLASH_READY: flash operation has been completed
      \arg        FLASH_BUSY: flash operation is in progress
      \arg        FLASH_WPERR: flash erase/program protection error
      \arg        FLASH_PGSERR: flash program sequence error
      \arg        FLASH_RPERR: flash read protection error
      \arg        FLASH_RSERR: flash read secure error
      \arg        FLASH_TOERR: flash timeout error
*/
flash_state_enum nvmc_flash_32bytes_program(uint32_t address, uint64_t data[])
{
    uint32_t index;
    flash_state_enum flash_state = FLASH_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_FLASH_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x002FU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(data)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x002FU), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* wait for the flash ready */
        flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);

        if(FLASH_READY == flash_state) {
            /* set flash program size */
            NVMC_PERFCTL &= ~NVMC_PERFCTL_FLASH_PG_SZ;
            NVMC_PERFCTL |= FLASH_PROG_SIZE_32BYTES;
            /* set the PG bit to start program */
            NVMC_FLASH_CTL |= NVMC_FLASH_CTL_PG;

            __ISB();
            __DSB();

            for(index = 0U; index < 4U; index++) {
                REG64(address) = data[index];
                __DSB();
                address += 8U;
            }

            __ISB();
            __DSB();

            /* wait for the flash ready */
            flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);
            /* reset the PG bit */
            NVMC_FLASH_CTL &= ~NVMC_FLASH_CTL_PG;
        }
    }
    /* return the flash state */
    return flash_state;
}

/*!
    \brief      erase page of flash (API_ID(0x0030U))
    \param[in]  address: page address to erase (case1: 0x08200000U - 0x0897FFFF, case2 and case3:0x08200000U - 0x0857FFFF)
    \param[out] none
    \retval     state of flash
      \arg        FLASH_READY: flash operation has been completed
      \arg        FLASH_BUSY: flash operation is in progress
      \arg        FLASH_WPERR: flash erase/program protection error
      \arg        FLASH_PGSERR: flash program sequence error
      \arg        FLASH_RPERR: flash read protection error
      \arg        FLASH_RSERR: flash read secure error
      \arg        FLASH_TOERR: flash timeout error
*/
flash_state_enum nvmc_flash_page_erase(uint32_t address)
{
    flash_state_enum flash_state = FLASH_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_FLASH_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0030U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* wait for the flash ready */
        flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);

        if(FLASH_READY == flash_state) {
            NVMC_FLASH_CTL |= NVMC_FLASH_CTL_PER;
            /* write the page address */
            NVMC_FLASH_ADDR = address;
            /* start sector erase */
            NVMC_FLASH_CTL |= NVMC_FLASH_CTL_START;
            /* wait for the flash ready */
            flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);
            /* reset the SER bit */
            NVMC_FLASH_CTL &= (~NVMC_FLASH_CTL_PER);
        }
    }
    /* return the flash state */
    return flash_state;
}

/*!
    \brief      erase sector of flash (API_ID(0x0031U))
    \param[in]  address: sector address to erase (case1: 0x08200000U - 0x0897FFFF, case2 and case3:0x08200000U - 0x0857FFFF)
    \param[out] none
    \retval     state of flash
      \arg        FLASH_READY: flash operation has been completed
      \arg        FLASH_BUSY: flash operation is in progress
      \arg        FLASH_WPERR: flash erase/program protection error
      \arg        FLASH_PGSERR: flash program sequence error
      \arg        FLASH_RPERR: flash read protection error
      \arg        FLASH_RSERR: flash read secure error
      \arg        FLASH_TOERR: flash timeout error
*/
flash_state_enum nvmc_flash_sector_erase(uint32_t address)
{
    flash_state_enum flash_state = FLASH_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_FLASH_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0031U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* wait for the flash ready */
        flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);

        if(FLASH_READY == flash_state) {
            NVMC_FLASH_CTL |= NVMC_FLASH_CTL_SER;
            /* write the sector address */
            NVMC_FLASH_ADDR = address;
            /* start sector erase */
            NVMC_FLASH_CTL |= NVMC_FLASH_CTL_START;
            /* wait for the flash ready */
            flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);
            /* reset the SER bit */
            NVMC_FLASH_CTL &= (~NVMC_FLASH_CTL_SER);
        }
    }
    /* return the flash state */
    return flash_state;
}

/*!
    \brief      erase whole flash (API_ID(0x0032U))
    \param[in]  none
    \param[out] none
    \retval     state of flash
      \arg        FLASH_READY: flash operation has been completed
      \arg        FLASH_BUSY: flash operation is in progress
      \arg        FLASH_WPERR: flash erase/program protection error
      \arg        FLASH_PGSERR: flash program sequence error
      \arg        FLASH_RPERR: flash read protection error
      \arg        FLASH_RSERR: flash read secure error
      \arg        FLASH_TOERR: flash timeout error
*/
flash_state_enum nvmc_flash_mass_erase(void)
{
    flash_state_enum flash_state = FLASH_READY;

    /* wait for the flash ready */
    flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);

