wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
    if(FLASH_READY == flash_state) {
        /* enable mass erase operation */
        NVMC_FLASH_CTL |= NVMC_FLASH_CTL_MER;
        /* start whole chip erase */
        NVMC_FLASH_CTL |= NVMC_FLASH_CTL_START;
        /* wait for the flash ready */
        flash_state = nvmc_flash_ready_wait(FLASH_TIMEOUT_COUNT);
        /* reset the MER bit */
        NVMC_FLASH_CTL &= ~NVMC_FLASH_CTL_MER;
    }

    /* return the flash state */
    return flash_state;
}

/*!
   \brief      get flash flag set or reset (API_ID(0x0033U))
   \param[in]  flash_flag: check flash flag
               only one parameter can be selected which is shown as below:
     \arg        FLASH_FLAG_BUSY: flash busy flag
     \arg        FLASH_FLAG_ENDF: flash end of operation flag
     \arg        FLASH_FLAG_WPERR: flash write protection error flag
     \arg        FLASH_FLAG_PGSERR: flash program sequence error flag
     \arg        FLASH_FLAG_RPERR: flash read protection error flag
     \arg        FLASH_FLAG_RSERR: flash read secure error flag
     \arg        FLASH_FLAG_ECCDET: flash two bits detect error flag
   \param[out] none
   \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_flash_flag_get(uint32_t flash_flag)
{
    FlagStatus flag = RESET;

    if(NVMC_FLASH_STAT & flash_flag) {
        flag = SET;
    }
    /* return the state of corresponding flash flag */
    return flag;
}

/*!
    \brief      clear the flash pending flag (API_ID(0x0034U))
    \param[in]  flash_flag: clear flash flag
                one or more parameters can be selected which is shown as below:
      \arg        FLASH_FLAG_ENDF: flash end of operation flag
      \arg        FLASH_FLAG_WPERR: flash write protection error flag
      \arg        FLASH_FLAG_PGSERR: flash program sequence error flag
      \arg        FLASH_FLAG_RPERR: flash read protection error flag
      \arg        FLASH_FLAG_RSERR: flash read secure error flag
      \arg        FLASH_FLAG_ECCDET: flash two bits detect error flag
    \param[out] none
    \retval     none
*/
void nvmc_flash_flag_clear(uint32_t flash_flag)
{
    /* clear the flags */
    NVMC_FLASH_STAT = flash_flag;
}

/*!
    \brief      enable flash interrupt (API_ID(0x0035U))
    \param[in]  flash_int: the flash interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        FLASH_INT_ENDIE: flash end of program interrupt
      \arg        FLASH_INT_WPERRIE: write protection error interrupt
      \arg        FLASH_INT_PGSERRIE: program sequence error interrupt
      \arg        FLASH_INT_RPERRIE: read protection error interrupt
      \arg        FLASH_INT_RSERRIE: read secure error interrupt
      \arg        FLASH_INT_ECCDETIE: two bits detect error interrupt
    \param[out] none
    \retval     none
*/
void nvmc_flash_interrupt_enable(uint32_t flash_int)
{
    NVMC_FLASH_CTL |= flash_int;
}

/*!
    \brief      disable flash interrupt (API_ID(0x0036U))
    \param[in]  flash_int: the flash interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        FLASH_INT_ENDIE: end of program interrupt
      \arg        FLASH_INT_WPERRIE: write protection error interrupt
      \arg        FLASH_INT_PGSERRIE: program sequence error interrupt
      \arg        FLASH_INT_RPERRIE: read protection error interrupt
      \arg        FLASH_INT_RSERRIE: secure error interrupt
      \arg        FLASH_INT_ECCDETIE: two bits detect error interrupt
    \param[out] none
    \retval     none
*/
void nvmc_flash_interrupt_disable(uint32_t flash_int)
{
    NVMC_FLASH_CTL &= ~(uint32_t)flash_int;
}

/*!
    \brief      get flash interrupt flag status (API_ID(0x0037U))
    \param[in]  flash_int_flag: flash interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        FLASH_INT_FLAG_ENDF: flash end of operation interrupt flag
      \arg        FLASH_INT_FLAG_WPERR: flash write protection error interrupt flag
      \arg        FLASH_INT_FLAG_PGSERR: flash program sequence error interrupt flag
      \arg        FLASH_INT_FLAG_RPERR: flash read protection error interrupt flag
      \arg        FLASH_INT_FLAG_RSERR: flash read secure error interrupt flag
      \arg        FLASH_INT_FLAG_ECCDET: flash two bits detect error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_flash_interrupt_flag_get(uint8_t flash_int_flag)
{
    FlagStatus reval = RESET;

    uint32_t reg1 = NVMC_FLASH_STAT;
    uint32_t reg2 = NVMC_FLASH_CTL;

    switch(flash_int_flag) {
    /* flash end of operation interrupt */
    case FLASH_INT_FLAG_ENDF:
        reg1 = reg1 & NVMC_FLASH_STAT_ENDF;
        reg2 = reg2 & NVMC_FLASH_CTL_ENDIE;
        break;
    /* flash write protection error interrupt */
    case FLASH_INT_FLAG_WPERR:
        reg1 = reg1 & NVMC_FLASH_STAT_WPERR;
        reg2 = reg2 & NVMC_FLASH_CTL_WPERRIE;
        break;
    /* flash program sequence error interrupt */
    case FLASH_INT_FLAG_PGSERR:
        reg1 = reg1 & NVMC_FLASH_STAT_PGSERR;
        reg2 = reg2 & NVMC_FLASH_CTL_PGSERRIE;
        break;
    /* flash read protection error interrupt */
    case FLASH_INT_FLAG_RPERR:
        reg1 = reg1 & NVMC_FLASH_STAT_RPERR;
        reg2 = reg2 & NVMC_FLASH_CTL_RPERRIE;
        break;
    /* flash read secure error interrupt */
    case FLASH_INT_FLAG_RSERR:
        reg1 = reg1 & NVMC_FLASH_STAT_RSERR;
        reg2 = reg2 & NVMC_FLASH_CTL_RSERRIE;
        break;
    /* flash two bits detect error interrupt */
    case FLASH_INT_FLAG_ECCDET:
        reg1 = reg1 & NVMC_FLASH_STAT_ECCDET;
        reg2 = reg2 & NVMC_FLASH_CTL_ECCDETIE;
        break;
    default :
        break;
    }
    /*get flash interrupt flag status */
    if((0U != reg1) && (0U != reg2)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear flash interrupt flag status (API_ID(0x0038U))
    \param[in]  flash_int_flag: flash interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        FLASH_INT_FLAG_ENDF: flash end of operation interrupt flag
      \arg        FLASH_INT_FLAG_WPERR: flash write protection error interrupt flag
      \arg        FLASH_INT_FLAG_PGSERR: flash program sequence error interrupt flag
      \arg        FLASH_INT_FLAG_RPERR: flash read protection error interrupt flag
      \arg        FLASH_INT_FLAG_RSERR: flash read secure error interrupt flag
      \arg        FLASH_INT_FLAG_ECCDET: flash two bits detect error interrupt flag
    \param[out] none
    \retval     none
*/
void nvmc_flash_interrupt_flag_clear(uint8_t flash_int_flag)
{

    switch(flash_int_flag) {
    /* flash end of operation interrupt */
    case FLASH_INT_FLAG_ENDF:
        NVMC_FLASH_STAT |= NVMC_FLASH_STAT_ENDF;
        break;
    /* flash write protection error interrupt */
    case FLASH_INT_FLAG_WPERR:
        NVMC_FLASH_STAT |= NVMC_FLASH_STAT_WPERR;
        break;
    /* flash program sequence error interrupt */
    case FLASH_INT_FLAG_PGSERR:
        NVMC_FLASH_STAT |= NVMC_FLASH_STAT_PGSERR;
        break;
    /* flash read protection error interrupt */
    case FLASH_INT_FLAG_RPERR:
        NVMC_FLASH_STAT |= NVMC_FLASH_STAT_RPERR;
        break;
    /* flash read secure error interrupt */
    case FLASH_INT_FLAG_RSERR:
        NVMC_FLASH_STAT |= NVMC_FLASH_STAT_RSERR;
        break;
    /* flash two bits detect error interrupt */
    case FLASH_INT_FLAG_ECCDET:
        NVMC_FLASH_STAT |= NVMC_FLASH_STAT_ECCDET;
        break;
    default :
        break;
    }

