wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
}

/*!
    \brief      get the flash state (API_ID(0x0039U))
    \param[in]  none
    \param[out] none
    \retval     state of flash
      \arg        FLASH_READY: flash operation has been completed
      \arg        FLASH_BUSY: flash operation is in progress
      \arg        FLASH_WPERR: flash erase/program protection error
      \arg        FLASH_PGSERR: flash program sequence error
      \arg        FLASH_RPERR: flash read protection error
      \arg        FLASH_RSERR: flash read secure error
*/
static flash_state_enum nvmc_flash_state_get(void)
{
    flash_state_enum flash_state = FLASH_READY;

    if(FLASH_FLAG_BUSY == (NVMC_FLASH_STAT & FLASH_FLAG_BUSY)) {
        flash_state = FLASH_BUSY;
    } else if(RESET != (NVMC_FLASH_STAT & FLASH_FLAG_WPERR)) {
        flash_state = FLASH_WPERR;
    } else if(RESET != (NVMC_FLASH_STAT & FLASH_FLAG_RSERR)) {
        flash_state = FLASH_RSERR;
    } else if(RESET != (NVMC_FLASH_STAT & FLASH_FLAG_RPERR)) {
        flash_state = FLASH_RPERR;
    } else if(RESET != (NVMC_FLASH_STAT & FLASH_FLAG_PGSERR)) {
        flash_state = FLASH_PGSERR;
    } else {
        flash_state = FLASH_READY;
    }

    /* return the flash state */
    return flash_state;
}

/*!
    \brief      check whether flash is ready or not (API_ID(0x003AU))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of flash
      \arg        FLASH_READY: flash operation has been completed
      \arg        FLASH_BUSY: flash operation is in progress
      \arg        FLASH_WPERR: flash erase/program protection error
      \arg        FLASH_PGSERR: flash program sequence error
      \arg        FLASH_RPERR: flash read protection error
      \arg        FLASH_RSERR: flash read secure error
      \arg        FLASH_TOERR: flash timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static flash_state_enum nvmc_flash_ready_wait(uint32_t timeout)
{
    flash_state_enum flash_state = FLASH_BUSY;

    /* wait for flash ready */
    do {
        /* get flash state */
        flash_state = nvmc_flash_state_get();
        timeout--;
    } while((FLASH_BUSY == flash_state) && (0U != timeout));

    if(FLASH_BUSY == flash_state) {
        flash_state = FLASH_TOERR;
    }
    /* return the flash state */
    return flash_state;
}

/*!
    \brief      program a half-word at the OTP corresponding address (API_ID(0x003BU))
    \param[in]  address: address to program (0x1FFF0000 + 0x20 * x (x = 0 ... 207))
    \param[in]  data: half-word to program
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_BUSY: OTP operation is in progress
      \arg        OTP_DATAERR: OTP Data error
      \arg        OTP_PGLKERR: OTP Program at lock state error
      \arg        OTP_MULTI_DATAERR: OTP Multi-redundant data error
      \arg        OTP_PGSERR: OTP program sequence error
      \arg        OTP_TOERR: OTP ENVM timeout error
*/
otp_state_enum nvmc_otp_halfword_program(uint32_t address, uint16_t data)
{
    otp_state_enum otp_state = OTP_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_OTP_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x003BU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* wait for the OTP ready */
        otp_state = nvmc_otp_ready_wait(OTP_TIMEOUT_COUNT);

        if(OTP_READY == otp_state) {
            NVMC_ENVM_CTL |= NVMC_ENVM_CTL_PG;
            REG16(address) = data;
            __DSB();
            otp_state = nvmc_otp_ready_wait(OTP_TIMEOUT_COUNT);
            NVMC_ENVM_CTL &= ~NVMC_ENVM_CTL_PG;
        }
    }
    return otp_state;
}

/*!
    \brief     program all AES KEY parameter (API_ID(0x003CU))
    \param[in]  buf: data buffer to write
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_BUSY: OTP operation is in progress
      \arg        OTP_DATAERR: OTP Data error
      \arg        OTP_PGLKERR: OTP Program at lock state error
      \arg        OTP_MULTI_DATAERR: OTP Multi-redundant data error
      \arg        OTP_PGSERR: OTP program sequence error
      \arg        OTP_TOERR: OTP ENVM timeout error
*/
otp_state_enum nvmc_otp_aes_key_all_program(uint16_t buf[])
{
    uint32_t index;
    uint32_t OTP_HALFWORD_CNT = (uint32_t)AES_KEY_SIZE / 2U;
    otp_state_enum otp_state = OTP_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(buf)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x003CU), ERR_PARAM_POINTER);
    } else
#endif
    {
        for(index = 0U; index < OTP_HALFWORD_CNT; index++) {
            nvmc_otp_flag_clear(OTP_FLAG_ENDF | OTP_FLAG_DATAERR | OTP_FLAG_PGLKERR | OTP_FLAG_PGSERR | OTP_FLAG_MULTI_DATAERR);
            otp_state = nvmc_otp_halfword_program(OTP_AES_KEY_AXI_ADDR + index * 0x20U, buf[index]);
            if(OTP_READY != otp_state) {
                break;
            }
        }
    }

    return otp_state;
}

/*!
    \brief      program all debug password parameter (API_ID(0x003DU))
    \param[in]  buf: data buffer to write
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_BUSY: OTP operation is in progress
      \arg        OTP_DATAERR: OTP Data error
      \arg        OTP_PGLKERR: OTP Program at lock state error
      \arg        OTP_MULTI_DATAERR: OTP Multi-redundant data error
      \arg        OTP_PGSERR: OTP program sequence error
      \arg        OTP_TOERR: OTP ENVM timeout error
*/
otp_state_enum nvmc_otp_dp_all_program(uint16_t buf[])
{
    uint32_t index;
    uint32_t OTP_HALFWORD_CNT = (uint32_t)USER_DP_SIZE / 2U;
    otp_state_enum otp_state = OTP_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(buf)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x003DU), ERR_PARAM_POINTER);
    } else
#endif
    {
        for(index = 0U; index < OTP_HALFWORD_CNT; index++) {
            nvmc_otp_flag_clear(OTP_FLAG_ENDF | OTP_FLAG_DATAERR | OTP_FLAG_PGLKERR | OTP_FLAG_PGSERR | OTP_FLAG_MULTI_DATAERR);
            otp_state = nvmc_otp_halfword_program(OTP_USER_DBGPSWD_DATA_AXI_ADDR + index * 0x20U, buf[index]);
            if(OTP_READY != otp_state) {
                break;
            }
        }
    }
    return otp_state;
}

/*!
    \brief      program all user data parameter (API_ID(0x003EU))
    \param[in]  buf: data buffer to write
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_BUSY: OTP operation is in progress
      \arg        OTP_DATAERR: OTP Data error
      \arg        OTP_PGLKERR: OTP Program at lock state error
      \arg        OTP_MULTI_DATAERR: OTP Multi-redundant data error
      \arg        OTP_PGSERR: OTP program sequence error
      \arg        OTP_TOERR: OTP ENVM timeout error
*/
otp_state_enum nvmc_otp_user_data_all_program(uint16_t buf[])
{
    uint32_t index;
    uint32_t OTP_HALFWORD_CNT = (uint32_t)USER_DATA_SIZE / 2U;
    otp_state_enum otp_state = OTP_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(buf)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x003EU), ERR_PARAM_POINTER);
    } else
#endif
    {
        for(index = 0U; index < OTP_HALFWORD_CNT; index++) {
            nvmc_otp_flag_clear(OTP_FLAG_ENDF | OTP_FLAG_DATAERR | OTP_FLAG_PGLKERR | OTP_FLAG_PGSERR | OTP_FLAG_MULTI_DATAERR);
            otp_state = nvmc_otp_halfword_program(OTP_USER_DATA_AXI_ADDR + index * 0x20U, buf[index]);
            if(OTP_READY != otp_state) {
                break;
            }
        }
    }
    return otp_state;
}

/*!
    \brief      repair OTP data (API_ID(0x003FU))
    \param[in]  none
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_BUSY: OTP operation is in progress
      \arg        OTP_DATAERR: OTP Data error
      \arg        OTP_PGLKERR: OTP Program at lock state error
      \arg        OTP_MULTI_DATAERR: OTP Multi-redundant data error
      \arg        OTP_PGSERR: OTP program sequence error
      \arg        OTP_TOERR: OTP ENVM timeout error
*/
otp_state_enum nvmc_otp_repair(void)
{
    otp_state_enum otp_state = OTP_READY;

    /* wait for the OTP ready */
    otp_state = nvmc_otp_ready_wait(OTP_TIMEOUT_COUNT);

    if(OTP_READY == otp_state) {
        NVMC_OTP_CTL |= NVMC_OTP_CTL_OTP_REPSTART;
        otp_state = nvmc_otp_ready_wait(OTP_TIMEOUT_COUNT);
    }

    return otp_state;
}

/*!
    \brief      get OTP flag set or reset (API_ID(0x0040U))
    \param[in]  otp_flag: check OTP flag
                only one parameter can be selected which is shown as below:
      \arg        OTP_FLAG_BUSY: OTP busy flag
      \arg        OTP_FLAG_ENDF: OTP end of operation flag
      \arg        OTP_FLAG_DATAERR: OTP Data error flag
      \arg        OTP_FLAG_PGLKERR: OTP Program at lock state error flag
      \arg        OTP_FLAG_PGSERR: OTP program sequence error flag
      \arg        OTP_FLAG_MULTI_DATAERR: OTP Multi-redundant data error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_otp_flag_get(uint32_t otp_flag)
{
    FlagStatus flag = RESET;

    if(NVMC_OTP_STAT & (uint32_t)otp_flag) {
        flag = SET;
    }
    /* return the state of corresponding OTP flag */
    return flag;
}

/*!
    \brief      clear OTP flag (API_ID(0x0041U))
    \param[in]  otp_flag: check OTP flag
                one or more parameters can be selected which is shown as below:
      \arg        OTP_FLAG_ENDF: OTP end of operation flag
      \arg        OTP_FLAG_DATAERR: OTP Data error flag
      \arg        OTP_FLAG_PGLKERR: OTP Program at lock state error flag
      \arg        OTP_FLAG_PGSERR: OTP program sequence error flag
      \arg        OTP_FLAG_MULTI_DATAERR: OTP Multi-redundant data error flag
    \param[out] none
    \retval     none
*/
void nvmc_otp_flag_clear(uint32_t otp_flag)
{
    /* clear the flags */
    NVMC_OTP_STAT = (uint32_t)otp_flag;
}

/*!
    \brief      enable OTP interrupt (API_ID(0x0042U))
    \param[in]  otp_int: the OTP interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        OTP_INT_ENDIE: OTP program/repair end interrupt enable bit
      \arg        OTP_INT_DATAERRIE: OTP Data error interrupt enable bit
      \arg        OTP_INT_PGLKERRIE: OTP Program at lock state error interrupt enable bit
      \arg        OTP_INT_PGSERRIE: OTP program sequence error enable bit
      \arg        OTP_INT_MULTI_DATAERRIE: OTP Multi-redundant data error interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_otp_interrupt_enable(uint32_t otp_int)
{
    NVMC_OTP_CTL |= (uint32_t)otp_int;
}

/*!
    \brief      disable OTP interrupt (API_ID(0x0043U))
    \param[in]  otp_int: the OTP interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        OTP_INT_ENDIE: OTP program/repair end interrupt enable bit
      \arg        OTP_INT_DATAERRIE: OTP Data error interrupt enable bit
      \arg        OTP_INT_PGLKERRIE: OTP Program at lock state error interrupt enable bit
      \arg        OTP_INT_PGSERRIE: OTP program sequence error enable bit
      \arg        OTP_INT_MULTI_DATAERRIE: OTP Multi-redundant data error interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_otp_interrupt_disable(uint32_t otp_int)
{
    NVMC_OTP_CTL &= ~(uint32_t)otp_int;
}

/*!
    \brief      get OTP interrupt flag status (API_ID(0x0044U))
    \param[in]  otp_int_flag: OTP interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        OTP_INT_FLAG_ENDF: OTP end of operation interrupt flag
      \arg        OTP_INT_FLAG_DATAERR: OTP data error interrupt flag
      \arg        OTP_INT_FLAG_PGLKERR: OTP program at lock state error interrupt flag
      \arg        OTP_INT_FLAG_PGSERR: OTP program sequence error interrupt flag
      \arg        OTP_INT_FLAG_MULTI_DATAERR: OTP multi-redundant data error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_otp_interrupt_flag_get(uint8_t otp_int_flag)
{
    FlagStatus reval = RESET;

    uint32_t reg1 = NVMC_OTP_STAT;
    uint32_t reg2 = NVMC_OTP_CTL;

    switch(otp_int_flag) {
    /* OTP end of operation interrupt */
    case OTP_INT_FLAG_ENDF:
        reg1 = reg1 & NVMC_OTP_STAT_ENDF;
        reg2 = reg2 & NVMC_OTP_CTL_ENDIE;
        break;
    /* OTP data error interrupt */
    case OTP_INT_FLAG_DATAERR:
        reg1 = reg1 & NVMC_OTP_STAT_DATAERRF;
        reg2 = reg2 & NVMC_OTP_CTL_DATAERRIE;
        break;
    /* OTP program at lock state error interrupt */
    case OTP_INT_FLAG_PGLKERR:
        reg1 = reg1 & NVMC_OTP_STAT_PGLKERRF;
        reg2 = reg2 & NVMC_OTP_CTL_PGLKERRIE;
        break;
    /* OTP program sequence error interrupt */
    case OTP_INT_FLAG_PGSERR:
        reg1 = reg1 & NVMC_OTP_STAT_PGSERR;
        reg2 = reg2 & NVMC_OTP_CTL_PGSERRIE;
        break;
    /* OTP multi-redundant data error interrupt */
    case OTP_INT_FLAG_MULTI_DATAERR:
        reg1 = reg1 & NVMC_OTP_STAT_MULTI_DATAERRF;
        reg2 = reg2 & NVMC_OTP_CTL_MULTI_DATAERRIE;
        break;
    default :
        break;
    }
    /*get OTP interrupt flag status */
    if((0U != reg1) && (0U != reg2)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear OTP interrupt flag status (API_ID(0x0045U))
    \param[in]  otp_int_flag: OTP interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        OTP_INT_FLAG_ENDF: OTP end of operation interrupt flag
      \arg        OTP_INT_FLAG_DATAERR: OTP data error interrupt flag
      \arg        OTP_INT_FLAG_PGLKERR: OTP program at lock state error interrupt flag
      \arg        OTP_INT_FLAG_PGSERR: OTP program sequence error interrupt flag
      \arg        OTP_INT_FLAG_MULTI_DATAERR: OTP multi-redundant data error interrupt flag
    \param[out] none
    \retval     none
*/
void nvmc_otp_interrupt_flag_clear(uint8_t otp_int_flag)
{

    switch(otp_int_flag) {
    /* OTP end of operation interrupt */
    case OTP_INT_FLAG_ENDF:
        NVMC_OTP_STAT |= NVMC_OTP_STAT_ENDF;
        break;
    /* OTP data error interrupt */
    case OTP_INT_FLAG_DATAERR:
        NVMC_OTP_STAT |= NVMC_OTP_STAT_DATAERRF;
        break;
    /* OTP program at lock state error interrupt */
    case OTP_INT_FLAG_PGLKERR:
        NVMC_OTP_STAT |= NVMC_OTP_STAT_PGLKERRF;
        break;
    /* OTP program sequence error interrupt */
    case OTP_INT_FLAG_PGSERR:
        NVMC_OTP_STAT |= NVMC_OTP_STAT_PGSERR;
        break;
    /* OTP multi-redundant data error interrupt */
    case OTP_INT_FLAG_MULTI_DATAERR:
        NVMC_OTP_STAT |= NVMC_OTP_STAT_MULTI_DATAERRF;
        break;
    default :
        break;
    }

