wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
}

/*!
    \brief      get the OTP state (API_ID(0x0046U))
    \param[in]  none
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_BUSY: OTP operation is in progress
      \arg        OTP_DATAERR: OTP Data error
      \arg        OTP_PGLKERR: OTP Program at lock state error
      \arg        OTP_MULTI_DATAERR: OTP Multi-redundant data error
      \arg        OTP_PGSERR: OTP program sequence error
*/
static otp_state_enum nvmc_otp_state_get(void)
{
    otp_state_enum otp_state = OTP_READY;

    if(OTP_FLAG_BUSY == (NVMC_OTP_STAT & NVMC_OTP_STAT_BUSY)) {
        otp_state = OTP_BUSY;
    } else if(RESET != (NVMC_OTP_STAT & NVMC_OTP_STAT_MULTI_DATAERRF)) {
        otp_state = OTP_MULTI_DATAERR;
    } else if(RESET != (NVMC_OTP_STAT & NVMC_OTP_STAT_PGLKERRF)) {
        otp_state = OTP_PGLKERR;
    } else if(RESET != (NVMC_OTP_STAT & NVMC_OTP_STAT_DATAERRF)) {
        otp_state = OTP_DATAERR;
    } else if(RESET != (NVMC_OTP_STAT & NVMC_OTP_STAT_PGSERR)) {
        otp_state = OTP_PGSERR;
    } else {
        otp_state = OTP_READY;
    }

    /* return the OTP state */
    return otp_state;
}

/*!
    \brief      check whether OTP is ready or not (API_ID(0x0047U))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_BUSY: OTP operation is in progress
      \arg        OTP_DATAERR: OTP Data error
      \arg        OTP_PGLKERR: OTP Program at lock state error
      \arg        OTP_MULTI_DATAERR: OTP Multi-redundant data error
      \arg        OTP_PGSERR: OTP program sequence error
      \arg        OTP_TOERR: OTP ENVM timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static otp_state_enum nvmc_otp_ready_wait(uint32_t timeout)
{
    otp_state_enum otp_state = OTP_BUSY;

    /* wait for OTP ready */
    do {
        /* get OTP state */
        otp_state = nvmc_otp_state_get();
        timeout--;
    } while((OTP_BUSY == otp_state) && (0U != timeout));

    if(OTP_BUSY == otp_state) {
        otp_state = OTP_TOERR;
    }

    /* return the OTP state */
    return otp_state;
}

/*!
    \brief      unlock the option byte operation (API_ID(0x0048U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_ob_unlock(void)
{
    if(RESET != (NVMC_OBCTL & NVMC_OBCTL_OBLK)) {
        /* write the NVMC key */
        NVMC_OBKEY = OB_UNLOCK_KEY0;
        NVMC_OBKEY = OB_UNLOCK_KEY1;
    }
}

/*!
    \brief      lock the option byte operation (API_ID(0x0049U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_ob_lock(void)
{
    /* reset the OB_LK bit */
    NVMC_OBCTL |= NVMC_OBCTL_OBLK;
}

/*!
    \brief      send option byte change command (API_ID(0x004AU))
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
*/
nvmc_ob_state_enum nvmc_ob_start(void)
{
    nvmc_ob_state_enum ob_state = NVMC_OB_READY;

    /* set the OB_START bit in OBCTL register */
    NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
    ob_state = nvmc_ob_ready_wait(FLASH_TIMEOUT_COUNT);

    return ob_state;
}

/*!
    \brief      modify option byte to factory value (API_ID(0x004BU))
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
      \arg        NVMC_OB_DCRP_SCR_PROT: DCRP/SCR protection is enabled, should not remove protection by this function.
*/
nvmc_ob_state_enum nvmc_ob_factory_value_config(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    uint32_t dcrp_area_end = (NVMC_DCRPADDR_EFT & NVMC_DCRPADDR_EFT_DCRP_AREA_END) >> DCRPADDR_DCRP_AREA_END_OFFSET;
    uint32_t dcrp_area_start = (NVMC_DCRPADDR_EFT & NVMC_DCRPADDR_EFT_DCRP_AREA_START) >> DCRPADDR_DCRP_AREA_START_OFFSET;
    uint32_t scr_area_end = (NVMC_SCRADDR_EFT & NVMC_SCRADDR_EFT_SCR_AREA_END) >> SCRADDR_SCR_AREA_END_OFFSET;
    uint32_t scr_area_start = (NVMC_SCRADDR_EFT & NVMC_SCRADDR_EFT_SCR_AREA_START) >> SCRADDR_SCR_AREA_START_OFFSET;

    /* check the option bytes security protection value */
    if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
        nvmc_ob_state = NVMC_HSPC;
    } else if((dcrp_area_end >= dcrp_area_start) || (scr_area_end >= scr_area_start)) {
        nvmc_ob_state = NVMC_OB_DCRP_SCR_PROT;
    } else {
        /* wait for the NVMC ready */
        nvmc_ob_state = nvmc_ob_ready_wait(FLASH_TIMEOUT_COUNT);

        if(NVMC_OB_READY == nvmc_ob_state) {
            /* write NVMC_OBSTAT0_MDF */
            NVMC_OBSTAT0_MDF = OB_OBSTAT0_FACTORY_VALUE;
            /* write NVMC_BTADDR_MDF */
            NVMC_BTADDR_MDF = OB_BTADDR_FACTORY_VALUE;
            /* write NVMC_OBSTAT1_MDF */
            NVMC_OBSTAT1_MDF = OB_OBSTAT1_FACTORY_VALUE;
            /* write NVMC_WP0_FLASH_MDF */
            NVMC_WP0_FLASH_MDF = OB_WP0_FLASH_FACTORY_VALUE;
            /* write NVMC_WP1_FLASH_MDF */
            NVMC_WP1_FLASH_MDF = OB_WP1_FLASH_FACTORY_VALUE;
            NVMC_OBREPCTL_MDF = OB_OBREPCTL_FACTORY_VALUE;
            NVMC_OBREPSTADDR_MDF = OB_OBREPSTADDR_FACTORY_VALUE;
            NVMC_OBREPENDADDR_MDF = OB_OBREPENDADDR_FACTORY_VALUE;
            NVMC_OBBBADDRX_MDF(0U) = OB_OBBBADDRX_FACTORY_VALUE;
            NVMC_OBBBADDRX_MDF(1U) = OB_OBBBADDRX_FACTORY_VALUE;
            NVMC_OBBBADDRX_MDF(2U) = OB_OBBBADDRX_FACTORY_VALUE;
            NVMC_OBBBADDRX_MDF(3U) = OB_OBBBADDRX_FACTORY_VALUE;
            /* write NVMC_WP_ENVM_MDF */
            NVMC_WP_ENVM_MDF = OB_WP_ENVM_FACTORY_VALUE;
            nvmc_ob_state = nvmc_ob_start();
        }

