wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
    nvmc_ob_state = nvmc_ob_obstat0_config(OB_FWDGT_SW, NVMC_OBSTAT0_MDF_NWDG_HW);

    return nvmc_ob_state;
}

/*!
    \brief      enable OTA check (API_ID(0x0054U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ota_check_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_OTA_CHECK_ENABLE, NVMC_OBSTAT0_MDF_OTA_CHECK);

    return nvmc_ob_state;
}

/*!
    \brief      disable OTA check (API_ID(0x0055U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ota_check_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_OTA_CHECK_DISABLE, NVMC_OBSTAT0_MDF_OTA_CHECK);

    return nvmc_ob_state;
}

/*!
    \brief      enable firmware update (API_ID(0x0056U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_firmware_update_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_FW_UPDATE_ENABLE, NVMC_OBSTAT0_MDF_FW_UPDATE);

    return nvmc_ob_state;
}

/*!
    \brief      disable firmware update (API_ID(0x0057U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_firmware_update_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_FW_UPDATE_DISABLE, NVMC_OBSTAT0_MDF_FW_UPDATE);

    return nvmc_ob_state;
}

/*!
    \brief      configure option byte bank0 as backup of ENVM (API_ID(0x0058U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_flash_bank0_backup_envm(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_ENVM_BANK0_BACKUP, NVMC_OBSTAT0_MDF_SWAP);

    return nvmc_ob_state;
}

/*!
    \brief      configure option byte bank1 as backup of ENVM (API_ID(0x0059U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_flash_bank1_backup_envm(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_ENVM_BANK1_BACKUP, NVMC_OBSTAT0_MDF_SWAP);

    return nvmc_ob_state;
}

/*!
    \brief      enable ECC of appointed region (API_ID(0x005AU))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  ecc_type: ecc type
                only one parameter can be selected which is shown as below:
      \arg        ITCM_ECC: ITCM ECC function
      \arg        DTCM0_ECC: DTCM0 ECC region
      \arg        DTCM1_ECC: DTCM1 ECC region
      \arg        R2_SRAM_ECC: Region 2 SRAM ECC region
      \arg        R1_SRAM_ECC: Region 1 SRAM ECC region
      \arg        R0_SRAM_ECC: Region 0 SRAM ECC region
      \arg        ENVM_ECC: ENVM ECC region
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecc_enable(uint32_t ecc_type)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    switch(ecc_type) {
    /* enable ITCM ECC */
    case ITCM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_ITCM_ECC_ENABLE, NVMC_OBSTAT0_MDF_ITCMECCEN);
        break;
    /* enable DTCM0 ECC */
    case DTCM0_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_DTCM0_ECC_ENABLE, NVMC_OBSTAT0_MDF_DTCM0ECCEN);
        break;
    /* enable DTCM1 ECC */
    case DTCM1_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_DTCM1_ECC_ENABLE, NVMC_OBSTAT0_MDF_DTCM1ECCEN);
        break;
    /* enable Region 2 SRAM ECC */
    case R2_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R2_SRAM_ECC_ENABLE, NVMC_OBSTAT0_MDF_R2_SRAM_ECCEN);
        break;
    /* enable Region 1 SRAM ECC */
    case R1_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R1_SRAM_ECC_ENABLE, NVMC_OBSTAT0_MDF_R1_SRAM_ECCEN);
        break;
    /* enable Region 0 SRAM ECC */
    case R0_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R0_SRAM_ECC_ENABLE, NVMC_OBSTAT0_MDF_R0_SRAM_ECCEN);
        break;
    /* enable ENVM ECC */
    case ENVM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_ENVM_ECC_ENABLE, NVMC_OBSTAT0_MDF_ENVM_ECC_OVRD);
        break;
    default:
        /* should not be here */
        break;
    }

    return nvmc_ob_state;
}

/*!
    \brief      disable ECC of appointed region (API_ID(0x005BU))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  ecc_type: ecc type
                only one parameter can be selected which is shown as below:
      \arg        ITCM_ECC: ITCM ECC region
      \arg        DTCM0_ECC: DTCM0 ECC region
      \arg        DTCM1_ECC: DTCM1 ECC region
      \arg        R2_SRAM_ECC: Region 2 SRAM ECC region
      \arg        R1_SRAM_ECC: Region 1 SRAM ECC region
      \arg        R0_SRAM_ECC: Region 0 SRAM ECC region
      \arg        ENVM_ECC: ENVM ECC region
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecc_disable(uint32_t ecc_type)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    switch(ecc_type) {
    /* enable ITCM ECC */
    case ITCM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_ITCM_ECC_DISABLE, NVMC_OBSTAT0_MDF_ITCMECCEN);
        break;
    /* enable DTCM0 ECC */
    case DTCM0_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_DTCM0_ECC_DISABLE, NVMC_OBSTAT0_MDF_DTCM0ECCEN);
        break;
    /* enable DTCM1 ECC */
    case DTCM1_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_DTCM1_ECC_DISABLE, NVMC_OBSTAT0_MDF_DTCM1ECCEN);
        break;
    /* enable Region 2 SRAM ECC */
    case R2_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R2_SRAM_ECC_DISABLE, NVMC_OBSTAT0_MDF_R2_SRAM_ECCEN);
        break;
    /* enable Region 1 SRAM ECC */
    case R1_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R1_SRAM_ECC_DISABLE, NVMC_OBSTAT0_MDF_R1_SRAM_ECCEN);
        break;
    /* enable Region 0 SRAM ECC */
    case R0_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R0_SRAM_ECC_DISABLE, NVMC_OBSTAT0_MDF_R0_SRAM_ECCEN);
        break;
    /* enable ENVM ECC */
    case ENVM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_ENVM_ECC_CONTROL_BY_ENVM_ECC_MODE, NVMC_OBSTAT0_MDF_ENVM_ECC_OVRD);
        break;
    default:
        /* should not be here */
        break;
    }

    return nvmc_ob_state;
}

/*!
    \brief      enable pipeline mode (API_ID(0x005CU))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_pipemode_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

