wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
                NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
                /* wait for the nvmc ready */
                nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
            }
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      enable erase/program protection (API_ID(0x0066U))
    \param[in]  wp_area: erase/program protection area, when case4 is selected, only WP_AREA_ENVM can be selected, WP_AREA_FLASH can not be selected.
                only one parameter can be selected which is shown as below:
      \arg        WP_AREA_FLASH: main flash erase/program protection area (in case1, case2 and case3, WP_AREA_FLASH can be selected, in case4, WP_AREA_FLASH can not be selected)
      \arg        WP_AREA_ENVM: ENVM erase/program protection area (in case1, case2, case3 and case4, WP_AREA_ENVM can be selected)
    \param[in]  ob_wp: specify sector to be erase/program protected, when wp_area = WP_AREA_ENVM, only OB_ENVM_WP_x and OB_ENVM_WP_ALL can be selected
                       when wp_area = WP_AREA_FLASH, only OB_FL_WP_x and OB_FL_WP_ALL can be selected
                one or more parameters can be selected which are shown as below:
      \arg        OB_ENVM_WP_x(when wp_area = WP_AREA_ENVM): write protect sector (x*2) ~ sector (x*2+1)(case1 and case2: x = 0,1...15, case3: x = 0,1...7, case4: x = 0,1...12) of ENVM
      \arg        OB_ENVM_WP_ALL(when wp_area = WP_AREA_ENVM): write protect all sectors of ENVM
      \arg        OB_FL_WP_x(when wp_area = WP_AREA_FLASH): write protect sector (x*2 + 32) ~ sector (x*2+33)(case1: x = 0,1...59, case2 and case3: x = 0,1...27, case4: OB_FL_WP_x is invalid) of main flash
      \arg        OB_FL_WP_ALL(when wp_area = WP_AREA_FLASH): write protect all sectors of main flash
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_write_protection_enable(wp_area_enum wp_area, uint64_t ob_wp)
{
    uint32_t wp_reg;
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    /* check the option bytes security protection value */
    if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
        nvmc_ob_state = NVMC_HSPC;
    } else {
        /* wait for the nvmc ready */
        nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

        if(NVMC_OB_READY == nvmc_ob_state) {
#ifndef NVM_VER_CASE4
            if(WP_AREA_FLASH == wp_area) {
                /* configure the enable erase/program protection bit in NVMC_WP0_FLASH_EFT register */
                wp_reg = NVMC_WP0_FLASH_EFT;
                wp_reg &= ~(uint32_t)(ob_wp & NVMC_WP0_FLASH_EFT_WP);
                NVMC_WP0_FLASH_MDF = wp_reg;

#if defined(NVM_VER_CASE1)
                /* configure the enable erase/program protection bit in NVMC_WP1_FLASH_EFT register */
                wp_reg = NVMC_WP1_FLASH_EFT;
                wp_reg &= ~(uint32_t)((ob_wp >> WP1_FLASH_OFFSET) & (uint32_t)(OB_FL_WP_ALL >> WP1_FLASH_OFFSET));
                NVMC_WP1_FLASH_MDF = wp_reg;
#endif /* NVM_VER_CASE1 */
                /* set the OBSTART bit */
                NVMC_OBCTL |= NVMC_OBCTL_OBSTART;

            } else
#endif /* NVM_VER_CASE4 */
            {
                if(WP_AREA_ENVM == wp_area) {
                    /* configure the enable erase/program protection bit in NVMC_WP_ENVM_MDF register */
                    wp_reg = NVMC_WP_ENVM_EFT;
                    wp_reg &= ~((uint32_t)ob_wp & OB_ENVM_WP_ALL);
                    NVMC_WP_ENVM_MDF = wp_reg;
                    /* set the OBSTART bit */
                    NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
                } else {
                    /* illegal parameters */
                }
            }

            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
        }
    }

    return nvmc_ob_state;
}

/*!
    \brief      disable erase/program protection (API_ID(0x0067U))
    \param[in]  wp_area: erase/program protection area, when case4 is selected, only WP_AREA_ENVM can be selected, WP_AREA_FLASH can not be selected.
                only one parameter can be selected which is shown as below:
      \arg        WP_AREA_FLASH: main flash erase/program protection area (in case1, case2 and case3, WP_AREA_FLASH can be selected, in case4, WP_AREA_FLASH can not be selected)
      \arg        WP_AREA_ENVM: ENVM erase/program protection area (in case1, case2, case3 and case4, WP_AREA_ENVM can be selected)
    \param[in]  ob_wp: specify sector to be erase/program protected, when wp_area = WP_AREA_ENVM, only OB_ENVM_WP_x and OB_ENVM_WP_ALL can be selected
                       when wp_area = WP_AREA_FLASH, only OB_FL_WP_x and OB_FL_WP_ALL can be selected
                one or more parameters can be selected which are shown as below:
      \arg        OB_ENVM_WP_x(when wp_area = WP_AREA_ENVM): write protect sector (x*2) ~ sector (x*2+1)(case1 and case2: x = 0,1...15, case3: x = 0,1...7, case4: x = 0,1...12) of ENVM
      \arg        OB_ENVM_WP_ALL(when wp_area = WP_AREA_ENVM): write protect all sectors of ENVM
      \arg        OB_FL_WP_x(when wp_area = WP_AREA_FLASH): write protect sector (x*2 + 32) ~ sector (x*2+33)(case1: x = 0,1...59, case2 and case3: x = 0,1...27, case4: OB_FL_WP_x is invalid) of main flash
      \arg        OB_FL_WP_ALL(when wp_area = WP_AREA_FLASH): write protect all sectors of main flash
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_write_protection_disable(wp_area_enum wp_area, uint64_t ob_wp)
{
    uint32_t wp_reg;
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    /* check the option bytes security protection value */
    if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
        nvmc_ob_state = NVMC_HSPC;
    } else {
        /* wait for the nvmc ready */
        nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

        if(NVMC_OB_READY == nvmc_ob_state) {
#ifndef NVM_VER_CASE4
            if(WP_AREA_FLASH == wp_area) {
                /* configure the disable erase/program protection bit in NVMC_WP0_FLASH_EFT register */
                wp_reg = NVMC_WP0_FLASH_EFT;
                wp_reg |= (uint32_t)(ob_wp & NVMC_WP0_FLASH_EFT_WP);
                NVMC_WP0_FLASH_MDF = wp_reg;

#if defined(NVM_VER_CASE1)
                /* configure the disable erase/program protection bit in NVMC_WP1_FLASH_EFT register */
                wp_reg = NVMC_WP1_FLASH_EFT;
                wp_reg |= (uint32_t)((ob_wp >> WP1_FLASH_OFFSET) & (uint32_t)(OB_FL_WP_ALL >> WP1_FLASH_OFFSET));
                NVMC_WP1_FLASH_MDF = wp_reg;
#endif /* NVM_VER_CASE1 */
                /* set the OBSTART bit */
                NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
            } else
#endif /* NVM_VER_CASE4 */
            {
                if(WP_AREA_ENVM == wp_area) {
                    /* configure the disable erase/program protection bit in NVMC_WP_ENVM_MDF register */
                    wp_reg = NVMC_WP_ENVM_EFT;
                    wp_reg |= (uint32_t)ob_wp & OB_ENVM_WP_ALL;
                    NVMC_WP_ENVM_MDF = wp_reg;
                    /* set the OBSTART bit */
                    NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
                } else {
                    /* illegal parameters */
                }
            }

