wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      program the option bytes OBREPCTL (API_ID(0x0068U))
    \param[in]  ob_repctl: repair control option bytes. When write one paramter, the corresponding mask should be set.
                one or more parameters can be selected which are shown as below:
      \arg        POR_RESET_REPAIR_DISABLE/POR_RESET_REPAIR_ENABLE: disable/enable power-on reset self-check repair function
      \arg        SYS_RESET_REPAIR_DISABLE/SYS_RESET_REPAIR_ENABLE: disable/enable system reset self-check repair function
      \arg        REPAIR_FAIL_FOR_ANY_ERROR/REPAIR_FAIL_FOR_MORE_THAN_ERR1: After repair, any error occurs(errors greater than 1 bit) as repair failure
      \arg        ECC2_AUTO_REPAIR_DISABLE/ECC2_AUTO_REPAIR_ENABLE: disable/enable 2 bits error automatic repair
      \arg        ECC1_AUTO_REPAIR_DISABLE/ECC1_AUTO_REPAIR_ENABLE: disable/enable 1 bit error automatic repair
      \arg        BAD_ENVM_ADDR_REPLACE_DISABLE/BAD_ENVM_ADDR_REPLACE_ENABLE: disable/enable bad data replacement in ENVM with flash content
      \arg        TWO_BIT_ERR_REPAIR_DISABLE/TWO_BIT_ERR_REPAIR_ENABLE: disable/enable fix address with two bit error
      \arg        ONE_BIT_ERR_REPAIR_DISABLE/ONE_BIT_ERR_REPAIR_ENABLE: disable/enable fix address with one bit error
      \arg        BOOTLOADER_CHECK_DISABLE/BOOTLOADER_CHECK_ENABLE: disable/enable bootloader self-check
      \arg        OB_HW_SELF_CHECK_DISABLE/OB_HW_SELF_CHECK_ENABLE: hardware not do self-check mode/hardware self-check mode
      \arg        OB_SYNC_MODE_DISABLE/OB_SYNC_MODE_ENABLE: disable/enable synchronization mode
    \param[in]  ob_repctl_mask: repair control bits mask. They correspond to the above paramter value one by one.
                  one or more parameters can be selected which are shown as below:
      \arg        NVMC_OBREPCTL_MDF_PORRSTREPDIS: The power-on reset self-check repair function enable status bit mask
      \arg        NVMC_OBREPCTL_MDF_SYSRSTREPDIS: The system reset self-check repair function enable status bit mask
      \arg        NVMC_OBREPCTL_MDF_BBMODE: Mode of determining whether the repair is successful after the repair bit mask
      \arg        NVMC_OBREPCTL_MDF_ERR2AUTOREPEN: 2 bits error automatic repair enable status bit mask
      \arg        NVMC_OBREPCTL_MDF_ERR1AUTOREPEN: 1 bit error automatic repair enable status bit mask
      \arg        NVMC_OBREPCTL_MDF_BBREPLEN: Bad block address replace status bit mask
      \arg        NVMC_OBREPCTL_MDF_ERR2REPEN: Two bit error repair enable status bit mask
      \arg        NVMC_OBREPCTL_MDF_ERR1REPEN: One bit error repair enable status bit mask
      \arg        NVMC_OBREPCTL_MDF_BLREPMOD: Bootloader self-check mode status bit mask
      \arg        NVMC_OBREPCTL_MDF_HWREPMOD: Hardware self-check mode status bit mask
      \arg        NVMC_OBREPCTL_MDF_SYNEN: The synchronization mode enable status bit mask
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_repair_control_config(uint32_t ob_repctl, uint32_t ob_repctl_mask)
{
    uint32_t obrepctl_reg;
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    /* check the option bytes security protection value */
    if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
        nvmc_ob_state = NVMC_HSPC;
    } else {
        /* wait for the nvmc ready */
        nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

        if(NVMC_OB_READY == nvmc_ob_state) {
            obrepctl_reg = NVMC_OBREPCTL_EFT;

            NVMC_OBREPCTL_MDF = (obrepctl_reg & (~ob_repctl_mask)) | (ob_repctl & ob_repctl_mask);
            NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure copy size during OTA update (API_ID(0x0069U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  value: copy size during OTA update with granularity 32KB. (value:0x00 - 0x3F, copy size = (value + 1) * 32KB)
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_copysz_config(uint32_t value)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_OB_COPY_SIZE(value)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0069U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        nvmc_ob_state = nvmc_ob_repair_control_config(value << OBREPCTL_COPYSZ_OFFSET, NVMC_OBREPCTL_MDF_COPYSZ);
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure two bit error counter interrupt threshold during self-check (API_ID(0x006AU))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  err2_cnt_threshold: two bit error counter threshold value.(0x00 - 0x1F)
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecc2cntth_config(uint32_t err2_cnt_threshold)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_OB_ERR2CNT_THRESHOLD(err2_cnt_threshold)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x006AU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        nvmc_ob_state = nvmc_ob_repair_control_config(err2_cnt_threshold << OBREPCTL_ERR2CNTTH_OFFSET, NVMC_OBREPCTL_MDF_ERR2CNTTH);
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure one bit error counter interrupt threshold during self-check (API_ID(0x006BU))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  err1_cnt_threshold: one bit error counter threshold value. (0x00 - 0x1F)
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecc1cntth_config(uint32_t err1_cnt_threshold)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_OB_ERR1CNT_THRESHOLD(err1_cnt_threshold)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x006BU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        nvmc_ob_state = nvmc_ob_repair_control_config(err1_cnt_threshold << OBREPCTL_ERR1CNTTH_OFFSET, NVMC_OBREPCTL_MDF_ERR1CNTTH);
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure sync area size (API_ID(0x006CU))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  value: sync area size with granularity 64KB. (value: 0x00 - 0x1F, sync area size = (value + 1) * 64KB)
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_sync_area_size_config(uint32_t value)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_OB_SYNC_SIZE(value)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x006CU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        nvmc_ob_state = nvmc_ob_repair_control_config(value << OBREPCTL_SYNSZ_OFFSET, NVMC_OBREPCTL_MDF_SYNSZ);
    }
    return nvmc_ob_state;
}

/*!
    \brief      enable power-on reset self-check repair (API_ID(0x006DU))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_power_on_self_check_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(POR_RESET_REPAIR_ENABLE, NVMC_OBREPCTL_MDF_PORRSTREPDIS);

    return nvmc_ob_state;
}

/*!
    \brief      disable power-on reset self-check repair (API_ID(0x006EU))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_power_on_self_check_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(POR_RESET_REPAIR_DISABLE, NVMC_OBREPCTL_MDF_PORRSTREPDIS);

    return nvmc_ob_state;
}

/*!
    \brief      enable system reset self-check repair (API_ID(0x006FU))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_system_reset_check_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(SYS_RESET_REPAIR_ENABLE, NVMC_OBREPCTL_MDF_SYSRSTREPDIS);

    return nvmc_ob_state;
}

/*!
    \brief      disable system reset self-check repair (API_ID(0x0070U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_system_reset_check_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(SYS_RESET_REPAIR_DISABLE, NVMC_OBREPCTL_MDF_SYSRSTREPDIS);

    return nvmc_ob_state;
}

/*!
    \brief      enable 2 bits error automatic repair (API_ID(0x0071U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecc2_auto_repair_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(ECC2_AUTO_REPAIR_ENABLE, NVMC_OBREPCTL_MDF_ERR2AUTOREPEN);

    return nvmc_ob_state;
}

/*!
    \brief      disable 2 bits error automatic repair (API_ID(0x0072U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecc2_auto_repair_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(ECC2_AUTO_REPAIR_DISABLE, NVMC_OBREPCTL_MDF_ERR2AUTOREPEN);

    return nvmc_ob_state;
}

/*!
    \brief      enable 1 bit error automatic repair (API_ID(0x0073U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecc1_auto_repair_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(ECC1_AUTO_REPAIR_ENABLE, NVMC_OBREPCTL_MDF_ERR1AUTOREPEN);

    return nvmc_ob_state;
}

/*!
    \brief      disable 1 bit error automatic repair (API_ID(0x0074U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function 
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecc1_auto_repair_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

