wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
                /* wait for the nvmc ready */
                nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
            }
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      get option byte hardware watchdog configuration (API_ID(0x0083U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_hardware_watchdog_get(void)
{
    FlagStatus flag = RESET;

    if(OB_FWDGT_HW == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_NWDG_HW)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte OTA check configuration (API_ID(0x0084U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_ota_check_get(void)
{
    FlagStatus flag = RESET;

    if(OB_OTA_CHECK_ENABLE == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_OTA_CHECK)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte firmware update configuration (API_ID(0x0085U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_firmware_update_get(void)
{
    FlagStatus flag = RESET;

    if(OB_FW_UPDATE_ENABLE == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_FW_UPDATE)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte ENVM backup bank number (API_ID(0x0086U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
uint8_t nvmc_ob_envm_backup_bank_get(void)
{
    uint8_t bank_number = 1U;

    if(OB_ENVM_BANK0_BACKUP == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SWAP)) {
        bank_number = 0U;
    } else {
        bank_number = 1U;
    }
    return bank_number;
}

/*!
    \brief      get the option byte secure mode (API_ID(0x0087U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_secure_mode_get(void)
{
    FlagStatus secure_mode_state = RESET;

    if(OB_SECURE_MODE_ENABLE == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SCR)) {
        secure_mode_state = SET;
    } else {
        secure_mode_state = RESET;
    }
    return secure_mode_state;
}

/*!
    \brief      get option byte ecc configuration (API_ID(0x0088U))
    \param[in]  ecc_type: ecc type index
                only one parameter can be selected which is shown as below:
      \arg        ITCM_ECC: ITCM ECC
      \arg        DTCM0_ECC: DTCM0 ECC
      \arg        DTCM1_ECC: DTCM1 ECC
      \arg        R2_SRAM_ECC: Region 2 SRAM ECC
      \arg        R1_SRAM_ECC: Region 1 SRAM ECC
      \arg        R0_SRAM_ECC: Region 0 SRAM ECC
      \arg        ENVM_ECC: ENVM ECC
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_ecc_get(ecc_type_enum ecc_type)
{
    FlagStatus ecc_mode;

    switch(ecc_type) {
    /* get ITCM ECC mode */
    case ITCM_ECC:
        if(OB_ITCM_ECC_ENABLE == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_ITCMECCEN)) {
            ecc_mode = SET;
        } else {
            ecc_mode = RESET;
        }
        break;
    /* get DTCM0 ECC mode */
    case DTCM0_ECC:
        if(OB_DTCM0_ECC_ENABLE == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_DTCM0ECCEN)) {
            ecc_mode = SET;
        } else {
            ecc_mode = RESET;
        }
        break;
    /* get DTCM1 ECC mode */
    case DTCM1_ECC:
        if(OB_DTCM1_ECC_ENABLE == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_DTCM1ECCEN)) {
            ecc_mode = SET;
        } else {
            ecc_mode = RESET;
        }
        break;
    /* get Region 2 SRAM ECC mode */
    case R2_SRAM_ECC:
        if(OB_R2_SRAM_ECC_ENABLE == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_R2_SRAM_ECCEN)) {
            ecc_mode = SET;
        } else {
            ecc_mode = RESET;
        }
        break;
    /* get Region 1 SRAM ECC mode */
    case R1_SRAM_ECC:
        if(OB_R1_SRAM_ECC_ENABLE == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_R1_SRAM_ECCEN)) {
            ecc_mode = SET;
        } else {
            ecc_mode = RESET;
        }
        break;
    /* get Region 0 SRAM ECC mode */
    case R0_SRAM_ECC:
        if(OB_R0_SRAM_ECC_ENABLE == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_R0_SRAM_ECCEN)) {
            ecc_mode = SET;
        } else {
            ecc_mode = RESET;
        }
        break;
    /* get ENVM ECC mode */
    case ENVM_ECC:
        if(OB_ENVM_ECC_ENABLE == (uint32_t)(NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_ENVM_ECC_OVRD)) {
            ecc_mode = SET;
        } else {
            ecc_mode = RESET;
        }
        break;
    default:
        /* should not be here */
        break;
    }

    return ecc_mode;
}

/*!
    \brief      get the option byte security protection level (API_ID(0x0089U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_security_protection_flag_get(void)
{
    FlagStatus spc_state = RESET;

    if(((NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC)) != OB_NSPC) {
        spc_state = SET;
    } else {
        spc_state = RESET;
    }
    return spc_state;
}

/*!
    \brief      get the option byte BOR threshold value (API_ID(0x008AU))
    \param[in]  none
    \param[out] none
    \retval     the BOR threshold value:
      \arg        OB_BOR_TH_VALUE3: BOR threshold value 3
      \arg        OB_BOR_TH_VALUE2: BOR threshold value 2
      \arg        OB_BOR_TH_VALUE1: BOR threshold value 1
      \arg        OB_BOR_TH_OFF: no BOR function
*/
uint32_t nvmc_ob_bor_threshold_get(void)
{
    return (uint32_t)((uint8_t)NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_BOR_TH);
}

/*!
    \brief      get ITCM size in ITCM/AXI shared RAM (API_ID(0x008BU))
    \param[in]  none
    \param[out] none
    \retval     itcm size: ITCM size in KB unit
*/
uint32_t nvmc_ob_itcm_axi_shared_ram_itcm_size_get(void)
{
    uint32_t itcm_size_ob_value;
    uint32_t itcm_kb_size;

    itcm_size_ob_value = (uint32_t)((uint32_t)NVMC_OBSTAT1_EFT & NVMC_OBSTAT1_EFT_ITCM_AXI_SHARED);

    switch(itcm_size_ob_value) {
    case OB_ITCM_AXI_SHARED_ITCM_64KB:
        /* ITCM size is 64KB */
        itcm_kb_size = 64U;
        break;
    case OB_ITCM_AXI_SHARED_ITCM_128KB:
        /* ITCM size is 128KB */
        itcm_kb_size = 128U;
        break;
    case OB_ITCM_AXI_SHARED_ITCM_192KB:
        /* ITCM size is 192KB */
        itcm_kb_size = 192U;
        break;
    case OB_ITCM_AXI_SHARED_ITCM_256KB:
        /* ITCM size is 256KB */
        itcm_kb_size = 256U;
        break;
    default:
        /* ITCM size is 0KB */
        itcm_kb_size = 0U;
        break;
    }

