wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
        *scr_area_start_addr = ((uint32_t)(scraddr_reg & NVMC_SCRADDR_EFT_SCR_AREA_START)) >> SCRADDR_SCR_AREA_START_OFFSET;
        *scr_area_end_addr = ((uint32_t)(scraddr_reg & NVMC_SCRADDR_EFT_SCR_AREA_END)) >> SCRADDR_SCR_AREA_END_OFFSET;

        if(*scr_area_en == 0U) {
            /* no valid secure area */
            address_stat = INVLD_ADDRESS_FLAG;
        } else {
            if((*scr_area_start_addr) == (*scr_area_end_addr)) {
                /* the whole flash bank1 memory is secure area */
                *scr_area_start_addr = MAIN_FLASH_BANK1_BASE_ADDRESS;
                *scr_area_end_addr = MAIN_FLASH_BANK1_BASE_ADDRESS + MAIN_FLASH_BANK1_SIZE - 1U;
                address_stat = VLD_ADDRESS_FLAG;
            } else if((*scr_area_start_addr) < (*scr_area_end_addr)) {
                /* get secure area start address */
                *scr_area_start_addr = (*scr_area_start_addr) * SCR_SIZE_UNIT;
                *scr_area_start_addr += MAIN_FLASH_BANK1_BASE_ADDRESS;

                /* get secure area end address */
                *scr_area_end_addr = ((*scr_area_end_addr) + 1U) * SCR_SIZE_UNIT - 1U;
                *scr_area_end_addr += MAIN_FLASH_BANK1_BASE_ADDRESS;
                address_stat = VLD_ADDRESS_FLAG;
            } else {
                /* no valid secure area */
                address_stat = INVLD_ADDRESS_FLAG;
            }
        }
    }
    return address_stat;
}
#endif /* NVM_VER_CASE2 */
#endif /* NVM_VER_CASE4 */

/*!
    \brief      get option byte write protection (API_ID(0x0093U))
    \param[in]  wp_area: write protection area
                only one parameter can be selected which is shown as below:
      \arg        WP_AREA_FLASH: main flash write protection area (only in case1, case2, case3, WP_AREA_FLASH can be selected )
      \arg        WP_AREA_ENVM: ENVM write protection area (for case1-4, WP_AREA_ENVM can be selected )
    \param[out] none
    \retval     the write protection option byte value(when wp_area = WP_AREA_FLASH, case1:0 - 0x0FFFFFFFFFFFFFFFU, case2 and case3:0 - 0x000000000FFFFFFFU)
                (when wp_area = WP_AREA_ENVM, case1 and case2:0 - 0x0000FFFFU, case3:0 - 0x000000FFU, case4:0 - 0x00001FFFU)
*/
uint64_t nvmc_ob_write_protection_get(wp_area_enum wp_area)
{
    uint64_t wp_cfg;

#ifndef NVM_VER_CASE4
    /* return write protection option byte value */
    if(WP_AREA_FLASH == wp_area) {
        /* flash write protection */
        uint32_t temp = NVMC_WP0_FLASH_EFT & NVMC_WP0_FLASH_EFT_WP;
        wp_cfg = (uint64_t)temp;
#ifdef NVM_VER_CASE1
        uint32_t wp1_val = NVMC_WP1_FLASH_EFT & NVMC_WP1_FLASH_EFT_WP;
        wp_cfg |= (uint64_t)wp1_val << WP1_FLASH_OFFSET;
#endif /* NVM_VER_CASE1 */
    } else
#endif /* NVM_VER_CASE4 */
    {
        if(WP_AREA_ENVM == wp_area) {
            /* ENVM write protection */
            wp_cfg = (uint64_t)(NVMC_WP_ENVM_EFT);
        } else {
            /* report error */
            wp_cfg = 0xFFFFFFFFFFFFFFFFU;
        }
    }
    return wp_cfg;
}

/*!
    \brief      get boot address (API_ID(0x0094U))
    \param[in]  none
    \param[out] boot_address_0: MSB of boot address 0
    \param[out] boot_address_1: MSB of boot address 1
    \retval     none
*/
void nvmc_ob_boot_address_get(uint32_t *boot_address_0, uint32_t *boot_address_1)
{
    uint32_t btaddr_reg;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(boot_address_0)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0094U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(boot_address_1)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0094U), ERR_PARAM_POINTER);
    } else
#endif
    {
        btaddr_reg = NVMC_BTADDR_EFT;
        *boot_address_0 = (uint32_t)((btaddr_reg & NVMC_BTADDR_EFT_BOOT_ADDR0) >> BTADDR_BOOT_ADDR0_OFFSET);
        *boot_address_1 = (uint32_t)((btaddr_reg & NVMC_BTADDR_EFT_BOOT_ADDR1) >> BTADDR_BOOT_ADDR1_OFFSET);
    }
}

/*!
    \brief      get option byte one bit error unrepaired counter interrupt threshold value (API_ID(0x0095U))
    \param[in]  none
    \param[out] none
    \retval     one bit error threshold value
*/
uint32_t nvmc_ob_err1_cnt_threshold_get(void)
{
    return (uint32_t)((NVMC_OBREPCTL_MDF & NVMC_OBREPCTL_MDF_ERR1CNTTH) >> OBREPCTL_ERR1CNTTH_OFFSET);
}

/*!
    \brief      get option byte two bit error unrepaired counter interrupt threshold value (API_ID(0x0096U))
    \param[in]  none
    \param[out] none
    \retval     two bit error threshold value
*/
uint32_t nvmc_ob_err2_cnt_threshold_get(void)
{
    return (uint32_t)((NVMC_OBREPCTL_MDF & NVMC_OBREPCTL_MDF_ERR2CNTTH) >> OBREPCTL_ERR2CNTTH_OFFSET);
}

/*!
    \brief      get option byte power-on reset self-check repair configuration (API_ID(0x0097U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_power_on_self_check_get(void)
{
    FlagStatus flag = RESET;

    if(POR_RESET_REPAIR_ENABLE == (uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_PORRSTREPDIS)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte system reset self-check repair configuration (API_ID(0x0098U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_system_reset_check_get(void)
{
    FlagStatus flag = RESET;

    if(SYS_RESET_REPAIR_ENABLE == (uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_SYSRSTREPDIS)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte 2 bits error automatic repair (API_ID(0x0099U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_ecc2_auto_repair_get(void)
{
    FlagStatus flag = RESET;

    if(ECC2_AUTO_REPAIR_ENABLE == (uint32_t)(NVMC_OBREPCTL_MDF & NVMC_OBREPCTL_MDF_ERR2AUTOREPEN)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte 1 bit errors automatic repair (API_ID(0x009AU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_ecc1_auto_repair_get(void)
{
    FlagStatus flag = RESET;

    if(ECC1_AUTO_REPAIR_ENABLE == (uint32_t)(NVMC_OBREPCTL_MDF & NVMC_OBREPCTL_MDF_ERR1AUTOREPEN)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte bad data replacement in ENVM with flash content (API_ID(0x009BU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_envm_bad_data_replace_get(void)
{
    FlagStatus flag = RESET;

    if(BAD_ENVM_ADDR_REPLACE_ENABLE == (uint32_t)(NVMC_OBREPCTL_MDF & NVMC_OBREPCTL_MDF_BBREPLEN)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte repair data with two bits error during self check (API_ID(0x009CU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_two_bits_error_repair_get(void)
{
    FlagStatus flag = RESET;

