wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_nvmc.c
    if(TWO_BIT_ERR_REPAIR_ENABLE == (uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_ERR2REPEN)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte repair data with one bit error during self check (API_ID(0x009DU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_one_bit_error_repair_get(void)
{
    FlagStatus flag = RESET;

    if(ONE_BIT_ERR_REPAIR_ENABLE == (uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_ERR1REPEN)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte bootloader self-check (API_ID(0x009EU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_bootloader_self_check_get(void)
{
    FlagStatus flag = RESET;

    if(BOOTLOADER_CHECK_ENABLE == (uint32_t)(NVMC_OBREPCTL_MDF & NVMC_OBREPCTL_MDF_BLREPMOD)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte synchronization mode (API_ID(0x009FU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_sync_mode_get(void)
{
    FlagStatus flag = RESET;

    if(OB_SYNC_MODE_ENABLE == (uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_SYNEN)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte synchronization area size in byte unit (API_ID(0x00A0U))
    \param[in]  none
    \param[out] none
    \retval     sync_area_size: synchronization area size
*/
uint32_t nvmc_ob_sync_area_size_get(void)
{
    uint32_t sync_area_size = 0U;

    if(OB_SYNC_MODE_ENABLE == (uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_SYNEN)) {
        sync_area_size = (((((uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_SYNSZ)) >> OBREPCTL_SYNSZ_OFFSET) + 1U) * SYNC_SIZE_UNIT);
    }
    return sync_area_size;
}

/*!
    \brief      get option byte hardware self-check mode (API_ID(0x00A1U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_hardware_self_check_get(void)
{
    FlagStatus flag = RESET;

    if(OB_HW_SELF_CHECK_ENABLE == (uint32_t)(NVMC_OBREPCTL_MDF & NVMC_OBREPCTL_MDF_HWREPMOD)) {
        flag = SET;
    }

    return flag;
}

/*!
    \brief      get option byte repair address (API_ID(0x00A2U))
    \param[in]  none
    \param[out] repair_start_addr: repair start address
    \param[out] repair_end_addr: repair end address
    \retval     state of repair address
      \arg        INVLD_ADDRESS_FLAG: the repair address is invalid
      \arg        VLD_ADDRESS_FLAG: the repair address is valid
*/
uint8_t nvmc_ob_repair_address_get(uint32_t *repair_start_addr, uint32_t *repair_end_addr)
{
    uint8_t address_stat = INVLD_ADDRESS_FLAG;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(repair_start_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x00A2U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(repair_end_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x00A2U), ERR_PARAM_POINTER);
    } else
#endif
    {
        *repair_start_addr = ((uint32_t)(NVMC_OBREPSTADDR_EFT & NVMC_OBREPSTADDR_EFT_STARTADDR)) >> OBREPSTADDR_STARTADDR_OFFSET;
        *repair_end_addr = ((uint32_t)(NVMC_OBREPENDADDR_MDF & NVMC_OBREPENDADDR_MDF_ENDADDR)) >> OBREPSTADDR_ENDADDR_OFFSET;

        if((*repair_start_addr) <= (*repair_end_addr)) {
            *repair_start_addr = ENVM_BASE_ADDRESS + (*repair_start_addr) * REPAIR_ADDRESS_UNIT;
            *repair_end_addr = ENVM_BASE_ADDRESS + (*repair_end_addr + 1U) * REPAIR_ADDRESS_UNIT - 1U;
            address_stat = VLD_ADDRESS_FLAG;
        } else {
            /* no valid repair area */
            address_stat = INVLD_ADDRESS_FLAG;
        }
    }
    return address_stat;
}

/*!
    \brief      get option byte bad block address (API_ID(0x00A3U))
    \param[in]  index: number of bad block address (0 - 3)
    \param[out] bad_block_address: bad block address
    \retval     state of bad block address
      \arg        INVLD_ADDRESS_FLAG: the address is invalid
      \arg        VLD_ADDRESS_FLAG: the address is valid
*/
uint8_t nvmc_ob_bad_block_address_get(uint32_t index, uint32_t *bad_block_address)
{
    uint32_t bad_block_valid;
    uint8_t address_stat = INVLD_ADDRESS_FLAG;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_BAD_BLOCK_INDEX(index)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x00A3U), ERR_PARAM_INVALID);
    } else if(NOT_VALID_POINTER(bad_block_address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x00A3U), ERR_PARAM_POINTER);
    } else
#endif
    {
        bad_block_valid = (NVMC_OBBBADDRX_EFT(index) & NVMC_OBBBADDRX_EFT_OBBBADDRVLD) >> OBBBADDRX_OBBBADDRVLD_OFFSET;
        if(bad_block_valid) {
            *bad_block_address = NVMC_OBBBADDRX_EFT(index) & (~NVMC_OBBBADDRX_EFT_OBBBADDRVLD);
            address_stat = VLD_ADDRESS_FLAG;
        } else {
            *bad_block_address = 0xFFFFFFFFU;
            /* no valid bad block address */
            address_stat = INVLD_ADDRESS_FLAG;
        }
    }
    return address_stat;
}

/*!
    \brief      get option byte flag set or reset (API_ID(0x00A4U))
    \param[in]  ob_flag: check option byte flag
                only one parameter can be selected which is shown as below:
      \arg        NVMC_FLAG_OBMERR: option byte modified error flag bit
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_flag_get(uint32_t ob_flag)
{
    FlagStatus flag = RESET;

    if(NVMC_OBCTL & ob_flag) {
        flag = SET;
    }
    /* return the state of corresponding flash flag */
    return flag;
}

/*!
    \brief      clear the option byte pending flag (API_ID(0x00A5U))
    \param[in]  ob_flag: clear option byte flag
                only one parameter can be selected which is shown as below:
      \arg        NVMC_FLAG_OBMERR: option byte modified error flag bit
    \param[out] none
    \retval     none
*/
void nvmc_ob_flag_clear(uint32_t ob_flag)
{
    uint32_t reg_value;

    reg_value = NVMC_OBCTL;
    reg_value |= ob_flag;

    /* clear the flag */
    NVMC_OBCTL = reg_value;
}

/*!
    \brief      enable option byte interrupt (API_ID(0x00A6U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_ob_interrupt_enable(void)
{
    NVMC_OBCTL |= NVMC_INT_OBMERRIE;
}

/*!
    \brief      disable option byte interrupt (API_ID(0x00A7U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_ob_interrupt_disable(void)
{
    NVMC_OBCTL &= ~(uint32_t)NVMC_INT_OBMERRIE;
}

/*!
    \brief      get option byte interrupt flag status (API_ID(0x00A8U))
    \param[in]  ob_int_flag: option byte interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        NVMC_INT_FLAG_OBMERR: option byte modified error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_interrupt_flag_get(uint8_t ob_int_flag)
{
    FlagStatus reval = RESET;

    uint32_t reg1 = NVMC_OBCTL;
    uint32_t reg2 = NVMC_OBCTL;

